duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
/****************************************Copyright (c)************************************************
** File name:			    screen.c
** Last modified Date:          
** Last Version:		   
** Descriptions:		   	使用的ncs版本-1.2		
** Created by:				谢彪
** Created date:			2020-12-16
** Version:			    	1.0
** Descriptions:			屏幕UI管理C文件
******************************************************************************************************/
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <zephyr/kernel.h>
#include "settings.h"
#include "lcd.h"
#include "font.h"
#include "img.h"
#include "key.h"
#include "datetime.h"
#include "max20353.h"
#ifdef CONFIG_PPG_SUPPORT
#include "max32674.h"
#endif
#ifdef CONFIG_IMU_SUPPORT
#include "lsm6dso.h"
#include "fall.h"
#ifdef CONFIG_SLEEP_SUPPORT
#include "sleep.h"
#endif/*CONFIG_SLEEP_SUPPORT*/
#endif
#include "external_flash.h"
#include "screen.h"
#include "ucs2.h"
#include "nb.h"
#include "sos.h"
#ifdef CONFIG_ALARM_SUPPORT
#include "alarm.h"
#endif
#include "gps.h"
#include "uart_ble.h"
#ifdef CONFIG_TOUCH_SUPPORT
#include "CST816.h"
#endif
#ifdef CONFIG_FOTA_DOWNLOAD
#include "fota_mqtt.h"
#endif/*CONFIG_FOTA_DOWNLOAD*/
#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
#include "data_download.h"
#endif/*CONFIG_DATA_DOWNLOAD_SUPPORT*/
#ifdef CONFIG_WIFI_SUPPORT
#include "esp8266.h"
#endif/*CONFIG_WIFI_SUPPORT*/
#ifdef CONFIG_SYNC_SUPPORT
#include "sync.h"
#endif/*CONFIG_SYNC_SUPPORT*/
#ifdef CONFIG_TEMP_SUPPORT
#include "temp.h"
#endif/*CONFIG_TEMP_SUPPORT*/
#ifdef CONFIG_FACTORY_TEST_SUPPORT
#include "ft_main.h"
#include "ft_aging.h"
#endif/*CONFIG_FACTORY_TEST_SUPPORT*/
#include "logger.h"

static uint8_t scr_index = 0;
static uint8_t bat_charging_index = 0;
static bool exit_notify_flag = false;
static bool entry_idle_flag = false;
static bool entry_setting_bk_flag = false;

static void NotifyTimerOutCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(notify_timer, NotifyTimerOutCallBack, NULL);
static void MainMenuTimerOutCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(mainmenu_timer, MainMenuTimerOutCallBack, NULL);
#ifdef CONFIG_PPG_SUPPORT
static void PPGStatusTimerOutCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(ppg_status_timer, PPGStatusTimerOutCallBack, NULL);
#endif
#ifdef CONFIG_TEMP_SUPPORT
static void TempStatusTimerOutCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(temp_status_timer, TempStatusTimerOutCallBack, NULL);
#endif

SCREEN_ID_ENUM screen_id = SCREEN_ID_BOOTUP;
SCREEN_ID_ENUM history_screen_id = SCREEN_ID_BOOTUP;
screen_msg scr_msg[SCREEN_ID_MAX] = {0};
notify_infor notify_msg = {0};

extern bool key_pwroff_flag;
extern uint8_t g_rsrp;

static void EnterHRScreen(void);

#ifdef IMG_FONT_FROM_FLASH
static uint32_t logo_img[] = 
{
	IMG_PWRON_ANI_1_ADDR,
	IMG_PWRON_ANI_2_ADDR,
	IMG_PWRON_ANI_3_ADDR,
	IMG_PWRON_ANI_4_ADDR,
	IMG_PWRON_ANI_5_ADDR,
	IMG_PWRON_ANI_6_ADDR
};
#else
static char *logo_img[] = 
{
	IMG_PWRON_ANI_1_ADDR,
	IMG_PWRON_ANI_1_ADDR,
	IMG_PWRON_ANI_1_ADDR,
	IMG_PWRON_ANI_1_ADDR,
	IMG_PWRON_ANI_1_ADDR
};
#endif

static uint16_t still_str[LANGUAGE_MAX][18] = {
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0053,0x0074,0x0061,0x0079,0x0020,0x0073,0x0074,0x0069,0x006C,0x006C,0x0000},//Stay still
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												{0x0052,0x0075,0x0068,0x0069,0x0067,0x0020,0x0068,0x0061,0x006C,0x0074,0x0065,0x006E,0x0000},//Ruhig halten
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												{0x0052,0x0065,0x0073,0x0074,0x0065,0x007A,0x0020,0x0069,0x006D,0x006D,0x006F,0x0062,0x0069,0x006C,0x0065,0x0000},//Restez immobile
											  #endif
											  #ifdef LANGUAGE_IT_ENABLE
												{0x0052,0x0069,0x006D,0x0061,0x006E,0x0065,0x0072,0x0065,0x0020,0x0066,0x0065,0x0072,0x006D,0x0069,0x0000},//Rimanere fermi
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												{0x004E,0x006F,0x0020,0x0074,0x0065,0x0020,0x006D,0x0075,0x0065,0x0076,0x0061,0x0073,0x0000},//No te muevas
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												{0x0046,0x0069,0x0071,0x0075,0x0065,0x0020,0x0070,0x0061,0x0072,0x0061,0x0064,0x006F,0x0000},//Fique parado
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												{0x005A,0x006F,0x0073,0x0074,0x0061,0x0144,0x0020,0x0077,0x0020,0x0062,0x0065,0x007A,0x0072,0x0075,0x0063,0x0068,0x0075,0x0000},//Zostań w bezruchu
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												{0x0056,0x0061,0x0072,0x0020,0x0073,0x0074,0x0069,0x006C,0x006C,0x0061,0x0000},//Var stilla
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												{0x9759,0x6B62,0x3092,0x4FDD,0x3064,0x0000},//静止を保つ
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												{0xAC00,0xB9CC,0xD788,0x0020,0xC788,0xC5B4,0x0000},//??? ??
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												{0x041D,0x0435,0x0020,0x0434,0x0432,0x0438,0x0433,0x0430,0x0442,0x044C,0x0441,0x044F,0x0000},//Не двигаться
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												{0x0627,0x0628,0x0642,0x0020,0x0633,0x0627,0x0643,0x0646,0x0627,0x0000},//??? ?????
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												{0x4FDD,0x6301,0x9759,0x6B62,0x0000},//保持静止
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0053,0x0074,0x0061,0x0079,0x0020,0x0073,0x0074,0x0069,0x006C,0x006C,0x0000},//Stay still
											  #endif
											#endif
											  };
static uint16_t Incon_1_str[LANGUAGE_MAX][25] = {
												#ifndef FW_FOR_CN
											      #ifdef LANGUAGE_EN_ENABLE
													{0x0049,0x006E,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0073,0x0069,0x0076,0x0065,0x002C,0x0020,0x0074,0x0072,0x0079,0x0020,0x006C,0x0061,0x0074,0x0065,0x0072,0x0000},//Inconclusive, try later
												  #endif
												  #ifdef LANGUAGE_DE_ENABLE
													{0x0042,0x0069,0x0074,0x0074,0x0065,0x0020,0x0065,0x0072,0x006E,0x0065,0x0075,0x0074,0x0020,0x0076,0x0065,0x0072,0x0073,0x0075,0x0000},//Bitte erneut versu
												  #endif
												  #ifdef LANGUAGE_FR_ENABLE
													{0x0045,0x0073,0x0073,0x0061,0x0079,0x0065,0x007A,0x0020,0x0070,0x006C,0x0075,0x0073,0x0020,0x0074,0x0061,0x0072,0x0064,0x0000},//Essayez plus tard
												  #endif
												  #ifdef LANGUAGE_IT_ENABLE
													{0x0052,0x0069,0x0070,0x0072,0x006F,0x0076,0x0061,0x0020,0x0070,0x0069,0x00F9,0x0020,0x0074,0x0061,0x0072,0x0064,0x0069,0x0000},//Riprova più tardi
												  #endif
												  #ifdef LANGUAGE_ES_ENABLE
													{0x0049,0x006E,0x0074,0x00E9,0x006E,0x0074,0x0061,0x006C,0x006F,0x0020,0x006D,0x00E1,0x0073,0x0020,0x0074,0x0061,0x0072,0x0064,0x0065,0x0000},//Inténtalo más tarde
												  #endif
												  #ifdef LANGUAGE_PT_ENABLE
													{0x0054,0x0065,0x006E,0x0074,0x0065,0x0020,0x0064,0x0065,0x0070,0x006F,0x0069,0x0073,0x0000},//Tente depois
												  #endif
												  #ifdef LANGUAGE_PL_ENABLE
													{0x004E,0x0069,0x0065,0x006A,0x0065,0x0064,0x006E,0x006F,0x007A,0x006E,0x002E,0x0020,0x0050,0x006F,0x006E,0x00F3,0x0077,0x0000},//Niejednozn. Ponów
												  #endif
												  #ifdef LANGUAGE_SE_ENABLE
													{0x004F,0x0074,0x0079,0x0064,0x006C,0x0069,0x0067,0x0074,0x002C,0x0020,0x0066,0x00F6,0x0072,0x0073,0x00F6,0x006B,0x0020,0x0073,0x0065,0x006E,0x0000},//Otydligt, f?rs?k sen
												  #endif
												  #ifdef LANGUAGE_JP_ENABLE
													{0x7D50,0x8AD6,0x51FA,0x305A,0x3001,0x5F8C,0x3067,0x8A66,0x3059,0x0000},//結論出ず、後で試す
												  #endif
												  #ifdef LANGUAGE_KR_ENABLE
													{0xC2E4,0xD328,0x002C,0x0020,0xCD94,0xD6C4,0x0020,0xC7AC,0xC2DC,0xB3C4,0x0000},//??, ?? ???
												  #endif
												  #ifdef LANGUAGE_RU_ENABLE
													{0x041F,0x043E,0x043F,0x0440,0x043E,0x0431,0x0443,0x0439,0x0442,0x0435,0x0020,0x043F,0x043E,0x0437,0x0436,0x0435,0x0000},//Попробуйте позже
												  #endif
												  #ifdef LANGUAGE_AR_ENABLE
													{0x062D,0x0627,0x0648,0x0644,0x0020,0x0645,0x0631,0x0629,0x0020,0x0623,0x062E,0x0631,0x0649,0x0020,0x0644,0x0627,0x062D,0x0642,0x064B,0x0627,0x0000},//???? ??? ???? ??????
												  #endif
												#else
												  #ifdef LANGUAGE_CN_ENABLE
													{0x6D4B,0x91CF,0x5931,0x8D25,0xFF0C,0x8BF7,0x7A0D,0x540E,0x91CD,0x8BD5,0x0000},//测量失败，请稍后重试
												  #endif
												  #ifdef LANGUAGE_EN_ENABLE
													{0x0049,0x006E,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0073,0x0069,0x0076,0x0065,0x002C,0x0020,0x0074,0x0072,0x0079,0x0020,0x006C,0x0061,0x0074,0x0065,0x0072,0x0000},//Inconclusive, try later
												  #endif
												#endif
												};
static uint16_t Incon_2_str[LANGUAGE_MAX][20] = {
												#ifndef FW_FOR_CN
												  #ifdef LANGUAGE_EN_ENABLE
													{0x0049,0x006E,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0073,0x0069,0x0076,0x0065,0x0000},//Inconclusive
												  #endif
												  #ifdef LANGUAGE_DE_ENABLE
													{0x0046,0x0065,0x0068,0x006C,0x0065,0x0072,0x0000},//Fehler
												  #endif
												  #ifdef LANGUAGE_FR_ENABLE
													{0x004E,0x006F,0x006E,0x0020,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0061,0x006E,0x0074,0x0000},//Non concluant
												  #endif
												  #ifdef LANGUAGE_IT_ENABLE
													{0x004E,0x006F,0x006E,0x0020,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0073,0x0069,0x0076,0x006F,0x0000},//Non conclusivo
												  #endif
												  #ifdef LANGUAGE_ES_ENABLE
													{0x0050,0x006F,0x0063,0x006F,0x0020,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0079,0x0065,0x006E,0x0074,0x0065,0x0000},//Poco concluyente
												  #endif
												  #ifdef LANGUAGE_PT_ENABLE
													{0x0049,0x006E,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0073,0x0069,0x0076,0x006F,0x0000},//Inconclusivo
												  #endif
												  #ifdef LANGUAGE_PL_ENABLE
													{0x0050,0x006F,0x006D,0x0069,0x0061,0x0072,0x0020,0x006E,0x0069,0x0065,0x006A,0x0065,0x0064,0x006E,0x006F,0x007A,0x006E,0x002E,0x0000},//Pomiar niejednozn.
												  #endif
												  #ifdef LANGUAGE_SE_ENABLE
													{0x004F,0x0074,0x0079,0x0064,0x006C,0x0069,0x0067,0x0000},//Otydlig
												  #endif
												  #ifdef LANGUAGE_JP_ENABLE
													{0x7D50,0x8AD6,0x304C,0x51FA,0x306A,0x3044,0x0000},//結論が出ない
												  #endif
												  #ifdef LANGUAGE_KR_ENABLE
													{0xCE21,0xC815,0x0020,0xC2E4,0xD328,0x0000},//?? ??
												  #endif
												  #ifdef LANGUAGE_RU_ENABLE
													{0x043D,0x0435,0x043E,0x043F,0x0440,0x0435,0x0434,0x0435,0x043B,0x0451,0x043D,0x043D,0x043E,0x0000},//неопределённо
												  #endif
												  #ifdef LANGUAGE_AR_ENABLE
													{0x063A,0x064A,0x0631,0x0020,0x062D,0x0627,0x0633,0x0645,0x0629,0x0000},//??? ?????
												  #endif
												#else
												  #ifdef LANGUAGE_CN_ENABLE
													{0x6D4B,0x91CF,0x5931,0x8D25,0x0000},//测量失败
												  #endif
												  #ifdef LANGUAGE_EN_ENABLE
													{0x0049,0x006E,0x0063,0x006F,0x006E,0x0063,0x006C,0x0075,0x0073,0x0069,0x0076,0x0065,0x0000},//Inconclusive
												  #endif
												#endif
												};
static uint16_t still_retry_str[LANGUAGE_MAX][22] = {
													#ifndef FW_FOR_CN
												      #ifdef LANGUAGE_EN_ENABLE
														{0x0053,0x0074,0x0061,0x0079,0x0020,0x0073,0x0074,0x0069,0x006C,0x006C,0x0020,0x0061,0x006E,0x0064,0x0020,0x0072,0x0065,0x0074,0x0072,0x0079,0x0000},//Stay still and retry
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														{0x0052,0x0075,0x0068,0x0069,0x0067,0x0020,0x0068,0x0061,0x006C,0x0074,0x0065,0x006E,0x0000},//Ruhig halten
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														{0x0052,0x00E9,0x0065,0x0073,0x0073,0x0061,0x0079,0x0065,0x0072,0x002E,0x002E,0x002E,0x0000},//Réessayer...
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														{0x0052,0x0069,0x0070,0x0072,0x006F,0x0076,0x0061,0x002E,0x002E,0x002E,0x0000},//Riprova...
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														{0x0049,0x006E,0x0074,0x0065,0x006E,0x0074,0x0061,0x0072,0x0020,0x006F,0x0074,0x0072,0x0061,0x0020,0x0076,0x0065,0x007A,0x002E,0x002E,0x002E,0x0000},//Intentar otra vez...
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														{0x0052,0x0065,0x0070,0x0065,0x0074,0x0069,0x006E,0x0064,0x006F,0x002E,0x002E,0x002E,0x0000},//Repetindo...
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														{0x005A,0x006F,0x0073,0x0074,0x0020,0x0077,0x0020,0x0062,0x0065,0x007A,0x0072,0x002E,0x0020,0x0050,0x006F,0x006E,0x00F3,0x0077,0x0000},//Zost w bezr. Ponów
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														{0x0053,0x0074,0x0069,0x006C,0x006C,0x0061,0x002C,0x0020,0x0066,0x00F6,0x0072,0x0073,0x00F6,0x006B,0x0020,0x0069,0x0067,0x0065,0x006E,0x0000},//Stilla, f?rs?k igen
													  #endif
													  #ifdef LANGUAGE_JP_ENABLE
														{0x9759,0x6B62,0x3057,0x3066,0x518D,0x6E2C,0x5B9A,0x0000},//静止して再測定
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														{0xAC00,0xB9CC,0xD788,0x0020,0xC788,0xB2E4,0xAC00,0x0020,0xC7AC,0xCE21,0xC815,0x0000},//??? ??? ???
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														{0x041F,0x043E,0x0432,0x0442,0x043E,0x0440,0x044F,0x0435,0x0442,0x0441,0x044F,0x2026,0x0000},//Повторяется…
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														{0x062D,0x0627,0x0648,0x0644,0x0020,0x062B,0x0627,0x0646,0x064A,0x0629,0x002E,0x002E,0x002E,0x0000},//...???? ?????
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														{0x4FDD,0x6301,0x9759,0x6B62,0xFF0C,0x91CD,0x65B0,0x6D4B,0x91CF,0x0000},//保持静止，重新测量
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														{0x0053,0x0074,0x0061,0x0079,0x0020,0x0073,0x0074,0x0069,0x006C,0x006C,0x0020,0x0061,0x006E,0x0064,0x0020,0x0072,0x0065,0x0074,0x0072,0x0079,0x0000},//Stay still and retry
													  #endif
													#endif
													};

