duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	   #ifdef LANGUAGE_JP_ENABLE
	 	case LANGUAGE_JP:
			x = IDLE_DATE_MON_CN_X;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_cn;
			str_d = str_day_cn;
			break;
 	   #endif
	   
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
			x = IDLE_DATE_MON_CN_X-10;
			y = IDLE_DATE_MON_CN_Y;
			w = IDLE_DATE_MON_CN_W+10;
			h = IDLE_DATE_MON_CN_H;
			str_m = str_mon_kr;
			str_d = str_day_kr;
			break;
	   #endif
		}
		
		LCD_FillColor(x, y, w, h, BLACK);
		if(date_time.month > 9)
		{
			LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.month/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.month%10]);

		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_m);
		LCD_MeasureUniString(str_m, &w, &h);
		
		x += w;
		if(date_time.day > 9)
		{
			LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.day/10]);
			x += IDLE_DATE_NUM_CN_W;
		}
		LCD_ShowImg_From_Flash(x, y+2, img_24_num[date_time.day%10]);
		
		x += IDLE_DATE_NUM_CN_W;
		LCD_ShowUniString(x, y, str_d);
		break;
 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/		
	
	default:
		switch(global_settings.language)
		{
	   #ifdef LANGUAGE_AR_ENABLE
		case LANGUAGE_AR:
			x = IDLE_DATE_DAY_EN_X;
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_mon[global_settings.language][date_time.month-1], 8);
			break;
	   #endif
	   
		default:
			x = IDLE_DATE_DAY_EN_X;
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_mon[global_settings.language][date_time.month-1], 8);
			break;
		}
		LCD_ShowImg_From_Flash(x+0*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y+4, img_20_num[date_time.day/10]);
		LCD_ShowImg_From_Flash(x+1*IDLE_DATE_NUM_EN_W, IDLE_DATE_DAY_EN_Y+4, img_20_num[date_time.day%10]);

		LCD_MeasureUniString(tmpbuf, &str_w, &str_h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
		{
			switch(global_settings.language)
			{
		   #ifdef LANGUAGE_AR_ENABLE
			case LANGUAGE_AR:
				x = IDLE_WEEK_EN_X;
				y = IDLE_WEEK_EN_Y;
				w = IDLE_DATE_MON_EN_W;
				h = IDLE_DATE_MON_EN_H;
				break;
		   #endif
		   
			default:
				x = IDLE_DATE_MON_EN_X;
				y = IDLE_DATE_MON_EN_Y;
				w = IDLE_DATE_MON_EN_W;
				h = IDLE_DATE_MON_EN_H;
				break;
			}
			LCD_FillColor(x, y, w, h, BLACK);
			
			if(w > str_w)
				LCD_ShowUniStringRtoL(x+(w+str_w)/2, y, tmpbuf);
			else
				LCD_ShowUniStringRtoL(x+w, y, tmpbuf);
		}
		else
	#endif		
		{
			LCD_FillColor(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, IDLE_DATE_MON_EN_W, IDLE_DATE_MON_EN_H, BLACK);
			
			if(IDLE_DATE_MON_EN_W > str_w)
				LCD_ShowUniString(IDLE_DATE_MON_EN_X+(IDLE_DATE_MON_EN_W-str_w)/2, IDLE_DATE_MON_EN_Y, tmpbuf);
			else
				LCD_ShowUniString(IDLE_DATE_MON_EN_X, IDLE_DATE_MON_EN_Y, tmpbuf);
		}
		break;
	}
#else
	LCD_SetFontSize(FONT_SIZE_32);

	sprintf((char*)str_date, "%02d", date_time.day);
	LCD_ShowString(IDLE_DATE_DAY_X,IDLE_DATE_DAY_Y,str_date);
	strcpy((char*)str_date, str_mon[date_time.month-1]);
	LCD_ShowString(IDLE_DATE_MON_X,IDLE_DATE_MON_Y,str_date);
#endif
}

void IdleShowSystemTime(void)
{
	static bool flag = false;
	uint32_t img_num[10] = {IMG_FONT_60_NUM_0_ADDR,IMG_FONT_60_NUM_1_ADDR,IMG_FONT_60_NUM_2_ADDR,IMG_FONT_60_NUM_3_ADDR,IMG_FONT_60_NUM_4_ADDR,
							IMG_FONT_60_NUM_5_ADDR,IMG_FONT_60_NUM_6_ADDR,IMG_FONT_60_NUM_7_ADDR,IMG_FONT_60_NUM_8_ADDR,IMG_FONT_60_NUM_9_ADDR};

	flag = !flag;

	LCD_ShowImg_From_Flash(IDLE_TIME_X+0*IDLE_TIME_NUM_W, IDLE_TIME_Y, img_num[date_time.hour/10]);
	LCD_ShowImg_From_Flash(IDLE_TIME_X+1*IDLE_TIME_NUM_W, IDLE_TIME_Y, img_num[date_time.hour%10]);
	
	if(flag)
		LCD_ShowImg_From_Flash(IDLE_TIME_X+2*IDLE_TIME_NUM_W, IDLE_TIME_Y, IMG_FONT_60_COLON_ADDR);
	else
		LCD_Fill(IDLE_TIME_X+2*IDLE_TIME_NUM_W, IDLE_TIME_Y, IDLE_TIME_COLON_W, IDLE_TIME_COLON_H, BLACK);
	
	LCD_ShowImg_From_Flash(IDLE_TIME_X+2*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y, img_num[date_time.minute/10]);
	LCD_ShowImg_From_Flash(IDLE_TIME_X+3*IDLE_TIME_NUM_W+IDLE_TIME_COLON_W, IDLE_TIME_Y, img_num[date_time.minute%10]);
}

void IdleShowSystemWeek(void)
{
	uint16_t x,y,w,h,str_w,str_h;
	uint8_t tmpbuf[128] = {0};
#ifdef FONTMAKER_UNICODE_FONT	
	uint16_t str_week[LANGUAGE_MAX][7][13] = {
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												{//English
													{0x0053,0x0075,0x006E,0x0000},//Sun
													{0x004D,0x006F,0x006E,0x0000},//Mon
													{0x0054,0x0075,0x0065,0x0000},//Tue
													{0x0057,0x0065,0x0064,0x0000},//Wed
													{0x0054,0x0068,0x0075,0x0000},//Thu
													{0x0046,0x0072,0x0069,0x0000},//Fri
													{0x0053,0x0061,0x0074,0x0000},//Sat
												},
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												{//Deutsch
													{0x0053,0x006F,0x006E,0x0000},//Son
													{0x004D,0x006F,0x006E,0x0000},//Mon
													{0x0044,0x0069,0x0065,0x0000},//Die
													{0x004D,0x0069,0x0074,0x0000},//Mit
													{0x0044,0x006F,0x006E,0x0000},//Don
													{0x0046,0x0072,0x0065,0x0000},//Fre
													{0x0053,0x0061,0x006D,0x0000},//Sam
												},
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												{//French
													{0x0044,0x0069,0x006D,0x0000},//Dim
													{0x004C,0x0075,0x006E,0x0000},//Lun
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x004D,0x0065,0x0072,0x0000},//Mer
													{0x004A,0x0065,0x0075,0x0000},//Jeu
													{0x0056,0x0065,0x006E,0x0000},//Ven
													{0x0053,0x0061,0x006D,0x0000},//Sam
												},
											  #endif
											  #ifdef LANGUAGE_IT_ENABLE
												{//Italian
													{0x0044,0x006F,0x006D,0x0000},//Dom
													{0x004C,0x0075,0x006E,0x0000},//Lun
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x004D,0x0065,0x0072,0x0000},//Mer
													{0x0047,0x0069,0x006F,0x0000},//Gio
													{0x0056,0x0065,0x006E,0x0000},//Ven
													{0x0053,0x0061,0x0062,0x0000},//Sab
												},
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												{//Spanish
													{0x0044,0x006F,0x006D,0x0000},//Dom
													{0x004C,0x0075,0x006E,0x0000},//Lun
													{0x004D,0x0061,0x0072,0x0000},//Mar
													{0x004D,0x0069,0x00E9,0x0000},//Mié
													{0x004A,0x0075,0x0065,0x0000},//Jue
													{0x0056,0x0069,0x0065,0x0000},//Vie
													{0x0053,0x00E1,0x0062,0x0000},//Sáb
												},
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												{//Portuguese
													{0x0044,0x006F,0x006D,0x0000},//Dom
													{0x0053,0x0065,0x0067,0x0000},//Seg
													{0x0054,0x0065,0x0072,0x0000},//Ter
													{0x0051,0x0075,0x0061,0x0000},//Qua
													{0x0051,0x0075,0x0069,0x0000},//Qui
													{0x0053,0x0065,0x0078,0x0000},//Sex
													{0x0053,0x00E1,0x0062,0x0000},//Sáb
												},
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												{//Polish
													{0x004E,0x0069,0x0065,0x0064,0x007A,0x0000},//Niedz
													{0x0050,0x006F,0x006E,0x002E,0x0000},//Pon.
													{0x0057,0x0074,0x002E,0x0000},//Wt.
													{0x015A,0x0072,0x002E,0x0000},//?r.
													{0x0043,0x007A,0x0077,0x002E,0x0000},//Czw.
													{0x0050,0x0074,0x002E,0x0000},//Pt.
													{0x0053,0x006F,0x0062,0x002E,0x0000},//Sob.
												},
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												{//Swedish
													{0x0053,0x00F6,0x006E,0x0000},//S?n
													{0x004D,0x00E5,0x006E,0x0000},//M?n
													{0x0054,0x0069,0x0073,0x0000},//Tis
													{0x004F,0x006E,0x0073,0x0000},//Ons
													{0x0054,0x006F,0x0072,0x0000},//Tor
													{0x0046,0x0072,0x0065,0x0000},//Fre
													{0x004C,0x00F6,0x0072,0x0000},//L?r
												},
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												{//Japanese
													{0x65E5,0x66DC,0x0000},//日曜
													{0x6708,0x66DC,0x0000},//月曜
													{0x706B,0x66DC,0x0000},//火曜
													{0x6C34,0x66DC,0x0000},//水曜
													{0x6728,0x66DC,0x0000},//木曜
													{0x91D1,0x66DC,0x0000},//金曜
													{0x571F,0x66DC,0x0000},//土曜
												},
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												{//Korea
													{0xC77C,0xC694,0xC77C,0x0000},//???
													{0xC6D4,0xC694,0xC77C,0x0000},//???
													{0xD654,0xC694,0xC77C,0x0000},//???
													{0xC218,0xC694,0xC77C,0x0000},//???
													{0xBAA9,0xC694,0xC77C,0x0000},//???
													{0xAE08,0xC694,0xC77C,0x0000},//???
													{0xD1A0,0xC694,0xC77C,0x0000},//???
												},
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												{//Russian
													{0x0412,0x0441,0x0000},//Вс
													{0x041F,0x043D,0x0000},//Пн
													{0x0412,0x0442,0x0000},//Вт
													{0x0421,0x0440,0x0000},//Ср
													{0x0427,0x0442,0x0000},//Чт
													{0x041F,0x0442,0x0000},//Пт
													{0x0421,0x0431,0x0000},//Сб
												},
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												{//Arabic
													{0x0627,0x0644,0x0623,0x062D,0x062F,0x0000},//?????
													{0x0627,0x0644,0x0625,0x062A,0x0646,0x064A,0x0646,0x0000},//?????
													{0x0627,0x0644,0x062A,0x0644,0x062A,0x0627,0x0621,0x0000},//?????
													{0x0627,0x0644,0x0623,0x0631,0x0628,0x0639,0x0627,0x0621,0x0000},//??????
													{0x0627,0x0644,0x062E,0x0645,0x064A,0x0633,0x0000},//????
													{0x0627,0x0644,0x062C,0x0645,0x0639,0x0629,0x0000},//????
													{0x0627,0x0644,0x0633,0x0628,0x062A,0x0000},//?????
												},
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												{
				 									{0x5468,0x65E5,0x0000},//周日
													{0x5468,0x4E00,0x0000},//周一
													{0x5468,0x4E8C,0x0000},//周二
													{0x5468,0x4E09,0x0000},//周三
													{0x5468,0x56DB,0x0000},//周四
													{0x5468,0x4E94,0x0000},//周五
													{0x5468,0x516D,0x0000},//周六
												},
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												{
													{0x0053,0x0075,0x006E,0x0000},//Sun
													{0x004D,0x006F,0x006E,0x0000},//Mon
													{0x0054,0x0075,0x0065,0x0000},//Tue
													{0x0057,0x0065,0x0064,0x0000},//Wed
													{0x0054,0x0068,0x0075,0x0000},//Thu
													{0x0046,0x0072,0x0069,0x0000},//Fri
													{0x0053,0x0061,0x0074,0x0000},//Sat
												},
											  #endif
											#endif
											};
#else
	uint8_t str_week[128] = {0};
#endif
	
	POINT_COLOR=WHITE;
	BACK_COLOR=BLACK;

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);

	switch(global_settings.language)
	{
   #ifdef LANGUAGE_CN_ENABLE
	case LANGUAGE_CHN:
		x = IDLE_WEEK_CN_X;
		y = IDLE_WEEK_CN_Y;
		w = IDLE_WEEK_CN_W;
		h = IDLE_WEEK_CN_H;
		break;
   #endif
   
   #if defined(LANGUAGE_JP_ENABLE)||defined(LANGUAGE_KR_ENABLE)
   #ifdef LANGUAGE_JP_ENABLE
	case LANGUAGE_JP:
   #endif
   #ifdef LANGUAGE_KR_ENABLE
	case LANGUAGE_KR:
   #endif		
		x = IDLE_WEEK_CN_X;
		y = IDLE_WEEK_CN_Y;
		w = IDLE_WEEK_CN_W;
		h = IDLE_WEEK_CN_H;
		break;
   #endif/*LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
   
