duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
void IdleUpdateHrData(void)
{
	uint16_t x,y,w,h;
	uint16_t bg_color = 0x1820;
	uint16_t bg_x,bg_y,icon_x,icon_y,str_x,str_y;
	uint8_t i,hr_show,count=1;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	hr_show = last_health.hr_rec.hr;
	
	LCD_Fill(hr_str_x, hr_str_y, IDLE_HR_STR_W, IDLE_HR_STR_H, bg_color);

	while(1)
	{
		if(hr_show/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	x = hr_str_x+(IDLE_HR_STR_W-count*IDLE_HR_NUM_W)/2;
	y = hr_str_y;

	for(i=0;i<count;i++)
	{
		LCD_ShowImg_From_Flash(x+i*IDLE_HR_NUM_W, hr_str_y, img_num[hr_show/divisor]);
		hr_show = hr_show%divisor;
		divisor = divisor/10;
	}
}

void IdleShowHrData(void)
{
	uint16_t x,y,w,h;
	uint16_t bg_color = 0x1820;
	uint8_t i=1,hr_show,count=1;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	if(global_settings.spo2_is_on)
		i++;
#ifdef CONFIG_TEMP_SUPPORT	
	if(global_settings.temp_is_on)
		i++;
#endif

	switch(i)
	{
	case 1://hr
	case 3://temp+hr+spo2	
		hr_bg_x = IDLE_HR_BG_X;
		hr_bg_y = IDLE_HR_BG_Y;
		hr_icon_x = IDLE_HR_ICON_X;
		hr_icon_y = IDLE_HR_ICON_Y;
		hr_str_x = IDLE_HR_STR_X;
		hr_str_y = IDLE_HR_STR_Y;
		break;
		
	case 2://hr+spo2 or temp+hr
		if(global_settings.spo2_is_on)
		{
			hr_bg_x = IDLE_TEMP_BG_X;
			hr_bg_y = IDLE_TEMP_BG_Y;
			hr_icon_x = hr_bg_x+(IDLE_HR_BG_W-IDLE_HR_ICON_W)/2;
			hr_icon_y = IDLE_TEMP_ICON_Y;
			hr_str_x = hr_bg_x+(IDLE_HR_BG_W-IDLE_HR_STR_W)/2;
			hr_str_y = IDLE_TEMP_STR_Y;
		}
		else
		{
			hr_bg_x = IDLE_SPO2_BG_X;
			hr_bg_y = IDLE_SPO2_BG_Y;
			hr_icon_x = hr_bg_x+(IDLE_HR_BG_W-IDLE_HR_ICON_W)/2;
			hr_icon_y = IDLE_SPO2_ICON_Y;
			hr_str_x = hr_bg_x+(IDLE_HR_BG_W-IDLE_HR_STR_W)/2;;
			hr_str_y = IDLE_SPO2_STR_Y;
		}
		break;
	}

	hr_show = last_health.hr_rec.hr;
	
	LCD_ShowImg_From_Flash(hr_bg_x, hr_bg_y, IMG_IDLE_HR_BG_ADDR);
	LCD_dis_pic_trans_from_flash(hr_icon_x, hr_icon_y, IMG_IDLE_HR_ICON_ADDR, bg_color);

	while(1)
	{
		if(hr_show/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	x = hr_str_x+(IDLE_HR_STR_W-count*IDLE_HR_NUM_W)/2;
	y = hr_str_y;

	for(i=0;i<count;i++)
	{
		LCD_ShowImg_From_Flash(x+i*IDLE_HR_NUM_W, y, img_num[hr_show/divisor]);
		hr_show = hr_show%divisor;
		divisor = divisor/10;
	}
}

void IdleUpdateSPO2Data(void)
{
	uint16_t x,y,w,h;
	uint16_t bg_color = 0x1820;
	uint8_t i,spo2_show,count=1;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	spo2_show = last_health.spo2_rec.spo2;
	
	LCD_Fill(spo2_str_x, spo2_str_y, IDLE_SPO2_STR_W, IDLE_SPO2_STR_H, bg_color);

	while(1)
	{
		if(spo2_show/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	x = spo2_str_x+(IDLE_SPO2_STR_W-(IDLE_SPO2_PERC_W+count*IDLE_SPO2_NUM_W))/2;
	y = spo2_str_y;

	for(i=0;i<count;i++)
	{
		LCD_ShowImg_From_Flash(x+i*IDLE_SPO2_NUM_W, y, img_num[spo2_show/divisor]);
		spo2_show = spo2_show%divisor;
		divisor = divisor/10;
	}
	LCD_ShowImg_From_Flash(x+count*IDLE_SPO2_NUM_W, y, IMG_FONT_20_PERC_ADDR);
}

void IdleShowSPO2Data(void)
{
	uint16_t x,y,w,h;
	uint16_t bg_color = 0x1820;
	uint8_t i=1,spo2_show,count=1;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	if(global_settings.hr_is_on)
		i++;
#ifdef CONFIG_TEMP_SUPPORT	
	if(global_settings.temp_is_on)
		i++;
#endif
	
	switch(i)
	{
	case 1://spo2
		spo2_bg_x = IDLE_HR_BG_X;
		spo2_bg_y = IDLE_HR_BG_Y;
		spo2_icon_x = spo2_bg_x+(IDLE_SPO2_BG_W-IDLE_SPO2_ICON_W)/2;
		spo2_icon_y = IDLE_HR_ICON_Y;
		spo2_str_x = spo2_bg_x+(IDLE_SPO2_BG_W-IDLE_SPO2_STR_W)/2;
		spo2_str_y = IDLE_HR_STR_Y;
		break;
		
	case 2://hr+spo2 or temp+spo2
	case 3://temp+hr+spo2	
		spo2_bg_x = IDLE_SPO2_BG_X;
		spo2_bg_y = IDLE_SPO2_BG_Y;
		spo2_icon_x = IDLE_SPO2_ICON_X;
		spo2_icon_y = IDLE_SPO2_ICON_Y;
		spo2_str_x = IDLE_SPO2_STR_X;
		spo2_str_y = IDLE_SPO2_STR_Y;
		break;
	}

	spo2_show = last_health.spo2_rec.spo2;

	LCD_ShowImg_From_Flash(spo2_bg_x, spo2_bg_y, IMG_IDLE_SPO2_BG_ADDR);
	LCD_dis_pic_trans_from_flash(spo2_icon_x, spo2_icon_y, IMG_IDLE_SPO2_ICON_ADDR, bg_color);

	while(1)
	{
		if(spo2_show/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

	x = spo2_str_x+(IDLE_SPO2_STR_W-(IDLE_SPO2_PERC_W+count*IDLE_SPO2_NUM_W))/2;
	y = spo2_str_y;

	for(i=0;i<count;i++)
	{
		LCD_ShowImg_From_Flash(x+i*IDLE_SPO2_NUM_W, y, img_num[spo2_show/divisor]);
		spo2_show = spo2_show%divisor;
		divisor = divisor/10;
	}
	LCD_ShowImg_From_Flash(x+count*IDLE_SPO2_NUM_W, y, IMG_FONT_20_PERC_ADDR);
}

#endif

#ifdef CONFIG_TEMP_SUPPORT
static uint16_t temp_bg_x,temp_bg_y,temp_icon_x,temp_icon_y,temp_str_x,temp_str_y;

void IdleUpdateTempData(void)
{
	uint16_t x,y,w,h;
	uint16_t bg_color = 0x00c3;
	uint8_t i,count=1;
	uint16_t temp_show;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_20_NUM_0_ADDR,IMG_FONT_20_NUM_1_ADDR,IMG_FONT_20_NUM_2_ADDR,IMG_FONT_20_NUM_3_ADDR,IMG_FONT_20_NUM_4_ADDR,
							IMG_FONT_20_NUM_5_ADDR,IMG_FONT_20_NUM_6_ADDR,IMG_FONT_20_NUM_7_ADDR,IMG_FONT_20_NUM_8_ADDR,IMG_FONT_20_NUM_9_ADDR};

	if(global_settings.temp_unit == TEMP_UINT_C)
	{
		LCD_dis_pic_trans_from_flash(temp_icon_x, temp_icon_y, IMG_IDLE_TEMP_C_ICON_ADDR, bg_color);
		temp_show = last_health.temp_rec.deca_temp;
	}
	else
	{
		LCD_dis_pic_trans_from_flash(temp_icon_x, temp_icon_y, IMG_IDLE_TEMP_F_ICON_ADDR, bg_color);
		temp_show = round((32+1.8*(last_health.temp_rec.deca_temp/10.0))*10.0);
	}

	while(1)
	{
		if(temp_show/divisor > 0)
		{
			count++;
			divisor = divisor*10;
		}
		else
		{
			divisor = divisor/10;
			break;
		}
	}

