duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	if(screen_id == SCREEN_ID_POWEROFF)
	{
		scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_FOTA;
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
	}

	key_pwroff_flag = true;
}

void poweroff_cancel(void)
{
	k_timer_stop(&mainmenu_timer);
	EnterIdleScreen();
}

void EnterPoweroffScreen(void)
{
	if(screen_id == SCREEN_ID_POWEROFF)
		return;

#ifdef NB_SIGNAL_TEST
	if(gps_is_working())
		MenuStopGPS();
#endif

#ifdef CONFIG_PPG_SUPPORT
	if(IsInPPGScreen()&&!PPGIsWorkingTiming())
		MenuStopPPG();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	if(TempIsWorking()&&!TempIsWorkingTiming())
		MenuStopTemp();
#endif

#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStop();
#endif

	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);

	LCD_Set_BL_Mode(LCD_BL_AUTO);

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_POWEROFF;	
	scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_POWEROFF].status = SCREEN_STATUS_CREATING;		
}

void PowerOffUpdateStatus(void)
{
	uint32_t img_anima[3] = {IMG_RUNNING_ANI_1_ADDR, IMG_RUNNING_ANI_2_ADDR, IMG_RUNNING_ANI_3_ADDR};

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif

#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaShow(POW_OFF_RUNNING_ANI_X, POW_OFF_RUNNING_ANI_Y, img_anima, ARRAY_SIZE(img_anima), 1000, true, NULL);
#endif	
}

void PowerOffShowStatus(void)
{
	uint16_t x,y,w,h;

	LCD_Clear(BLACK);

	LCD_ShowImg_From_Flash(PWR_OFF_ICON_X, PWR_OFF_ICON_Y, IMG_PWROFF_BUTTON_ADDR);

#ifdef CONFIG_FACTORY_TEST_SUPPORT
	ClearAllKeyHandler();
#endif
	SetLeftKeyUpHandler(poweroff_cancel);
	SetLeftKeyLongPressHandler(poweroff_confirm);
	
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();

	register_touch_event_handle(TP_EVENT_LONG_PRESS, PWR_OFF_ICON_X, PWR_OFF_ICON_X+PWR_OFF_ICON_W, PWR_OFF_ICON_Y, PWR_OFF_ICON_Y+PWR_OFF_ICON_H, poweroff_confirm);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterIdleScreen);

 #ifdef NB_SIGNAL_TEST
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSettings);
 #elif defined(CONFIG_FACTORY_TEST_SUPPORT)
 	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterFTAgingTest);
 #else
  #ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
  	if((strlen(g_ui_ver) == 0) 
		|| (strlen(g_font_ver) == 0)
		|| (strlen(g_ppg_algo_ver) == 0)
		)
	{
		SPIFlash_Read_DataVer(g_ui_ver, g_font_ver, g_ppg_algo_ver);
	}

   #if defined(CONFIG_PPG_DATA_UPDATE)&&defined(CONFIG_PPG_SUPPORT)
   	if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
  	{
  		register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_ppg_start);
   	}
	else
   #endif	
	{
		if((strcmp(g_new_font_ver,g_font_ver) != 0) && (strlen(g_new_font_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
		{
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_font_start);
		}
		else if((strcmp(g_new_ui_ver,g_ui_ver) != 0) && (strlen(g_new_ui_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
		{
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_img_start);
		}
		else
		{
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSettings);
		}
	}
  #else
  	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, EnterSettings);
  #endif
 #endif 
#endif
}

void PowerOffScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_POWEROFF].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_POWEROFF].status = SCREEN_STATUS_CREATED;

		PowerOffShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		PowerOffUpdateStatus();
		break;
	}
	
	scr_msg[SCREEN_ID_POWEROFF].act = SCREEN_ACTION_NO;
}

void SettingsUpdateStatus(void)
{
	uint8_t i,count;
	uint16_t x,y,w,h;
	uint16_t bg_clor = 0x2124;
	uint16_t green_clor = 0x07e0;
	
	k_timer_stop(&mainmenu_timer);

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else
	LCD_SetFontSize(FONT_SIZE_16);
#endif
	LCD_SetFontBgColor(bg_clor);

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif

	switch(settings_menu.id)
	{
	case SETTINGS_MENU_MAIN:
		{
			uint16_t lang_sle_str[LANGUAGE_MAX][10] = {
														#ifndef FW_FOR_CN
														  #ifdef LANGUAGE_EN_ENABLE
															{0x0045,0x006E,0x0067,0x006C,0x0069,0x0073,0x0068,0x0000},//English
														  #endif
														  #ifdef LANGUAGE_DE_ENABLE
															{0x0044,0x0065,0x0075,0x0074,0x0073,0x0063,0x0068,0x0000},//Deutsch
														  #endif
														  #ifdef LANGUAGE_FR_ENABLE
															{0x0046,0x0072,0x0061,0x006E,0x00E7,0x0061,0x0069,0x0073,0x0000},//Fran?ais
														  #endif
														  #ifdef LANGUAGE_IT_ENABLE
															{0x0049,0x0074,0x0061,0x006C,0x0069,0x0061,0x006E,0x006F,0x0000},//Italiano
														  #endif
														  #ifdef LANGUAGE_ES_ENABLE
															{0x0045,0x0073,0x0070,0x0061,0x00F1,0x006F,0x006C,0x0000},//Espa?ol
														  #endif
														  #ifdef LANGUAGE_PT_ENABLE
															{0x0050,0x006F,0x0072,0x0074,0x0075,0x0067,0x0075,0x00EA,0x0073,0x0000},//Português
														  #endif
														  #ifdef LANGUAGE_PL_ENABLE
															{0x0050,0x006F,0x006C,0x0073,0x006B,0x0069,0x0000},//Polski
														  #endif
														  #ifdef LANGUAGE_SE_ENABLE
															{0x0053,0x0076,0x0065,0x006E,0x0073,0x006B,0x0061,0x0000},//Svenska
														  #endif
														  #ifdef LANGUAGE_JP_ENABLE
															{0x65E5,0x672C,0x8A9E,0x0000},//日本語
														  #endif
														  #ifdef LANGUAGE_KR_ENABLE
															{0xD55C,0xAD6D,0xC5B4,0x0000},//???
														  #endif
														  #ifdef LANGUAGE_RU_ENABLE
															{0x0420,0x0443,0x0441,0x0441,0x043A,0x0438,0x0439,0x0000},//Русский
														  #endif
														  #ifdef LANGUAGE_AR_ENABLE
															{0x0627,0x0644,0x0639,0x0631,0x0628,0x064A,0x0629,0x0000},//???????
														  #endif
														#else
														  #ifdef LANGUAGE_CN_ENABLE
															{0x4E2D,0x6587,0x0000},//中文
														  #endif
														  #ifdef LANGUAGE_EN_ENABLE
															{0x0045,0x006E,0x0067,0x006C,0x0069,0x0073,0x0068,0x0000},//English
														  #endif
														#endif	
														};
			uint16_t menu_sle_str[LANGUAGE_MAX][3][14] = {
														#ifndef FW_FOR_CN
														  #ifdef LANGUAGE_EN_ENABLE
															{
																{0x0056,0x0069,0x0065,0x0077,0x0000},//View
																{0x0000},//null
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0000},//Reset
															},
														  #endif
														  #ifdef LANGUAGE_DE_ENABLE
															{
																{0x00DC,0x0062,0x0070,0x0072,0x002E,0x0000},//übpr.
																{0x0000},//null
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0000},//Reset
															},
														  #endif
														  #ifdef LANGUAGE_FR_ENABLE
															{
																{0x0056,0x006F,0x0069,0x0072,0x0000},//Voir
																{0x0000},//null
																{0x0052,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0000},//Réinit
															},
														  #endif
														  #ifdef LANGUAGE_IT_ENABLE
															{
																{0x0056,0x0069,0x0073,0x0074,0x0061,0x0000},//Vista
																{0x0000},//null
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0000},//Reset
															},
														  #endif
														  #ifdef LANGUAGE_ES_ENABLE
															{
																{0x0056,0x0065,0x0072,0x0000},//Ver
																{0x0000},//null
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0000},//Reset
															},
														  #endif
														  #ifdef LANGUAGE_PT_ENABLE
															{
																{0x0056,0x0065,0x0072,0x0000},//Ver
																{0x0000},//null
																{0x0052,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x0072,0x0000},//Redefinir
															},
														  #endif
														  #ifdef LANGUAGE_PL_ENABLE
															{
																{0x005A,0x006F,0x0062,0x002E,0x0000},//Zob.
																{0x0000},//null
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0000},//Reset
															},
														  #endif
														  #ifdef LANGUAGE_SE_ENABLE
															{
																{0x0056,0x0069,0x0073,0x0061,0x0000},//Visa
																{0x0000},//null
																{0x00C5,0x0074,0x0065,0x0072,0x002E,0x0000},//?ter.
															},
														  #endif
														  #ifdef LANGUAGE_JP_ENABLE
															{
																{0x78BA,0x8A8D,0x0000},//確認
																{0x0000},//null
																{0x521D,0x671F,0x5316,0x0000},//初期化
															},
														  #endif
														  #ifdef LANGUAGE_KR_ENABLE
															{
																{0xD655,0xC778,0x0000},//??
																{0x0000},//null
																{0xCD08,0xAE30,0xD654,0x0000},//???
															},
														  #endif
														  #ifdef LANGUAGE_RU_ENABLE
															{
																{0x0412,0x0438,0x0434,0x0000},//Вид
																{0x0000},//null
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0000},//Сброс
															},
														  #endif
														  #ifdef LANGUAGE_AR_ENABLE
															{
																{0x0645,0x0639,0x0627,0x064A,0x0646,0x0629,0x0000},//??????
																{0x0000},//null
																{0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0636,0x0628,0x0637,0x0000},//????? ???
															},
														  #endif
														#else
														  #ifdef LANGUAGE_CN_ENABLE
															{
																{0x67E5,0x770B,0x0000},//查看
																{0x0000},//空白
																{0x91CD,0x7F6E,0x0000},//重置
															},
														  #endif
														  #ifdef LANGUAGE_EN_ENABLE
															{
																{0x0056,0x0069,0x0065,0x0077,0x0000},//View
																{0x0000},//null
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0000},//Reset
															},
														  #endif
														#endif	
														  };
			uint16_t level_str[LANGUAGE_MAX][4][11] = {
														#ifndef FW_FOR_CN
														  #ifdef LANGUAGE_EN_ENABLE
															{
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0031,0x0000},//Level 1
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0032,0x0000},//Level 2
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0033,0x0000},//Level 3
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0034,0x0000},//Level 4
															},
														  #endif
														  #ifdef LANGUAGE_DE_ENABLE
															{
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0031,0x0000},//Level 1
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0032,0x0000},//Level 2
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0033,0x0000},//Level 3
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0034,0x0000},//Level 4
															},
														  #endif
														  #ifdef LANGUAGE_FR_ENABLE
															{
																{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0031,0x0000},//Niveau 1
																{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0032,0x0000},//Niveau 2
																{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0033,0x0000},//Niveau 3
																{0x004E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0034,0x0000},//Niveau 4
															},
														  #endif
														  #ifdef LANGUAGE_IT_ENABLE
															{
																{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0031,0x0000},//Livello 1
																{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0032,0x0000},//Livello 2
																{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0033,0x0000},//Livello 3
																{0x004C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0034,0x0000},//Livello 4
															},
														  #endif
														  #ifdef LANGUAGE_ES_ENABLE
															{
																{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0031,0x0000},//Nivel 1
																{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0032,0x0000},//Nivel 2
																{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0033,0x0000},//Nivel 3
																{0x004E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0034,0x0000},//Nivel 4
															},
														  #endif
														  #ifdef LANGUAGE_PT_ENABLE
															{
																{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0031,0x0000},//Nível 1
																{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0032,0x0000},//Nível 2
																{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0033,0x0000},//Nível 3
																{0x004E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0034,0x0000},//Nível 4
															},
														  #endif
														  #ifdef LANGUAGE_PL_ENABLE
															{
																{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0031,0x0000},//Poziom 1
																{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0032,0x0000},//Poziom 2
																{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0033,0x0000},//Poziom 3
																{0x0050,0x006F,0x007A,0x0069,0x006F,0x006D,0x0020,0x0034,0x0000},//Poziom 4
															},
														  #endif
														  #ifdef LANGUAGE_SE_ENABLE
															{
																{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0031,0x0000},//Niv? 1
																{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0032,0x0000},//Niv? 2
																{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0033,0x0000},//Niv? 3
																{0x004E,0x0069,0x0076,0x00E5,0x0020,0x0034,0x0000},//Niv? 4
															},
														  #endif
														  #ifdef LANGUAGE_JP_ENABLE
															{
																{0x30EC,0x30D9,0x30EB,0x0031,0x0000},//レベル1
																{0x30EC,0x30D9,0x30EB,0x0032,0x0000},//レベル2
																{0x30EC,0x30D9,0x30EB,0x0033,0x0000},//レベル3
																{0x30EC,0x30D9,0x30EB,0x0034,0x0000},//レベル4
															},
														  #endif
														  #ifdef LANGUAGE_KR_ENABLE
															{
																{0xB808,0xBCA8,0x0020,0x0031,0x0000},//?? 1
																{0xB808,0xBCA8,0x0020,0x0032,0x0000},//?? 2
																{0xB808,0xBCA8,0x0020,0x0033,0x0000},//?? 3
																{0xB808,0xBCA8,0x0020,0x0034,0x0000},//?? 4
															},
														  #endif
														  #ifdef LANGUAGE_RU_ENABLE
															{
																{0x0423,0x0440,0x002E,0x0020,0x0031,0x0000},//Ур. 1
																{0x0423,0x0440,0x002E,0x0020,0x0032,0x0000},//Ур. 2
																{0x0423,0x0440,0x002E,0x0020,0x0033,0x0000},//Ур. 3
																{0x0423,0x0440,0x002E,0x0020,0x0034,0x0000},//Ур. 4
															},
														  #endif
														  #ifdef LANGUAGE_AR_ENABLE
															{
																{0x0645,0x0633,0x062A,0x0648,0x0649,0x0020,0x0031,0x0000},//??????? 1
																{0x0645,0x0633,0x062A,0x0648,0x0649,0x0020,0x0032,0x0000},//??????? 2
																{0x0645,0x0633,0x062A,0x0648,0x0649,0x0020,0x0033,0x0000},//??????? 3
																{0x0645,0x0633,0x062A,0x0648,0x0649,0x0020,0x0034,0x0000},//??????? 4
															},
														  #endif
														#else
														  #ifdef LANGUAGE_CN_ENABLE
															{
																{0x7B49,0x7EA7,0x0031,0x0000},//等级1
																{0x7B49,0x7EA7,0x0032,0x0000},//等级2
																{0x7B49,0x7EA7,0x0033,0x0000},//等级3
																{0x7B49,0x7EA7,0x0034,0x0000},//等级4
															},
														  #endif
														  #ifdef LANGUAGE_EN_ENABLE
															{
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0031,0x0000},//Level 1
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0032,0x0000},//Level 2
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0033,0x0000},//Level 3
																{0x004c,0x0065,0x0076,0x0065,0x006c,0x0020,0x0034,0x0000},//Level 4
															},
														  #endif
														#endif
														};

