duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
				if((i+settings_menu.index) == global_settings.language)
				{
				#ifdef LANGUAGE_AR_ENABLE
					if(g_language_r2l)
						LCD_ShowImg_From_Flash(LCD_WIDTH-(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X)-SETTINGS_MENU_SEL_DOT_W, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_YES_ADDR);
					else
				#endif		
						LCD_ShowImg_From_Flash(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_YES_ADDR);
				}
				else
				{
				#ifdef LANGUAGE_AR_ENABLE
					if(g_language_r2l)
						LCD_ShowImg_From_Flash(LCD_WIDTH-(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X)-SETTINGS_MENU_SEL_DOT_W, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_NO_ADDR);
					else
				#endif		
						LCD_ShowImg_From_Flash(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_NO_ADDR);
				}

			#ifdef FONTMAKER_UNICODE_FONT
				LCD_MeasureUniString(settings_menu.name[global_settings.language][i+settings_menu.index], &w, &h);
			  #ifdef LANGUAGE_AR_ENABLE	
				if(g_language_r2l)
				{
					LCD_ShowUniStringRtoL(LCD_WIDTH-(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X),
										SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+(SETTINGS_MENU_BG_H-h)/2,
										settings_menu.name[global_settings.language][i+settings_menu.index]);
				}
				else
			  #endif		
				{
				 #ifdef LANGUAGE_AR_ENABLE
					if((i+settings_menu.index) == (settings_menu.count-1))
					{
						//Arabic names should be displayed from right to left even in other language settings
						LCD_ShowUniStringRtoL(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X+w,
										SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+(SETTINGS_MENU_BG_H-h)/2,
										settings_menu.name[global_settings.language][i+settings_menu.index]);
					}
					else
				 #endif		
					{
						LCD_ShowUniString(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X,
										SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+(SETTINGS_MENU_BG_H-h)/2,
										settings_menu.name[global_settings.language][i+settings_menu.index]);
					}
				}
			#endif

			#ifdef CONFIG_TOUCH_SUPPORT
				register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
											SETTINGS_MENU_BG_X, 
											SETTINGS_MENU_BG_X+SETTINGS_MENU_BG_W, 
											SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y), 
											SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_BG_H, 
											settings_menu.sel_handler[i]);
			#endif
			}
		}
		break;
		
	case SETTINGS_MENU_FACTORY_RESET:
		{
			static LANGUAGE_SET language_bk = LANGUAGE_MAX;
			uint16_t tmpbuf[128] = {0};
			
			LCD_Clear(BLACK);
			LCD_SetFontBgColor(BLACK);

			if(language_bk == LANGUAGE_MAX)
				language_bk = global_settings.language;
			
			switch(g_reset_status)
			{
			case RESET_STATUS_IDLE:
				{
					uint16_t str_ready[LANGUAGE_MAX][33] = {
															#ifndef FW_FOR_CN
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0074,0x006F,0x0020,0x0074,0x0068,0x0065,0x0020,0x0066,0x0061,0x0063,0x0074,0x006F,0x0072,0x0079,0x0020,0x0073,0x0065,0x0074,0x0074,0x0069,0x006E,0x0067,0x0073,0x0000},//Reset to the factory settings
															  #endif
															  #ifdef LANGUAGE_DE_ENABLE
																{0x0057,0x0065,0x0072,0x006B,0x0073,0x0065,0x0069,0x006E,0x0073,0x0074,0x0065,0x006C,0x006C,0x0075,0x006E,0x0067,0x0020,0x007A,0x0075,0x0072,0x00FC,0x0063,0x006B,0x0073,0x0065,0x0074,0x007A,0x0065,0x006E,0x0000},//Werkseinstellung zurücksetzen
															  #endif
															  #ifdef LANGUAGE_FR_ENABLE
																{0x0052,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0069,0x0061,0x006C,0x0069,0x0073,0x0061,0x0074,0x0069,0x006F,0x006E,0x0020,0x0064,0x0027,0x0075,0x0073,0x0069,0x006E,0x0065,0x0000},//Réinitialisation d'usine
															  #endif
															  #ifdef LANGUAGE_IT_ENABLE
																{0x0052,0x0069,0x0070,0x0072,0x0069,0x0073,0x0074,0x0069,0x006E,0x006F,0x0020,0x0064,0x0069,0x0020,0x0066,0x0061,0x0062,0x0062,0x0072,0x0069,0x0063,0x0061,0x0000},//Ripristino di fabbrica
															  #endif
															  #ifdef LANGUAGE_ES_ENABLE
																{0x0052,0x0065,0x0073,0x0074,0x0061,0x0062,0x006C,0x0065,0x0063,0x0069,0x006D,0x0069,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,0x0020,0x0066,0x00E1,0x0062,0x0072,0x0069,0x0063,0x0061,0x0000},//Restablecimiento de fábrica
															  #endif
															  #ifdef LANGUAGE_PT_ENABLE
																{0x0052,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x0065,0x0020,0x0066,0x00E1,0x0062,0x0072,0x0069,0x0063,0x0061,0x0000},//Redefini??o de fábrica
															  #endif
															  #ifdef LANGUAGE_PL_ENABLE
																{0x0055,0x0073,0x0074,0x0061,0x0077,0x0069,0x0065,0x006E,0x0069,0x0061,0x0020,0x0066,0x0061,0x0062,0x0072,0x0079,0x0063,0x007A,0x006E,0x0065,0x0000},//Ustawienia fabryczne
															  #endif
															  #ifdef LANGUAGE_SE_ENABLE
																{0x0046,0x0061,0x0062,0x0072,0x0069,0x006B,0x0073,0x00E5,0x0074,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,0x006C,0x006E,0x0069,0x006E,0x0067,0x0000},//Fabriks?terst?llning
															  #endif
															  #ifdef LANGUAGE_JP_ENABLE
																{0x5DE5,0x5834,0x51FA,0x8377,0x6642,0x8A2D,0x5B9A,0x306B,0x30EA,0x30BB,0x30C3,0x30C8,0x3059,0x308B,0x0000},//工場出荷時設定にリセットする
															  #endif
															  #ifdef LANGUAGE_KR_ENABLE
																{0xACF5,0xC7A5,0x0020,0xC124,0xC815,0xC73C,0xB85C,0x0020,0xBCF5,0xC6D0,0x0000},//?? ???? ??
															  #endif
															  #ifdef LANGUAGE_RU_ENABLE
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0020,0x0434,0x043E,0x0020,0x0437,0x0430,0x0432,0x043E,0x0434,0x0441,0x043A,0x0438,0x0445,0x0020,0x043D,0x0430,0x0441,0x0442,0x0440,0x043E,0x0435,0x043A,0x0000},//Сброс до заводских настроек
															  #endif
															  #ifdef LANGUAGE_AR_ENABLE
																{0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0627,0x0644,0x062A,0x0639,0x064A,0x064A,0x0646,0x0020,0x0625,0x0644,0x0649,0x0020,0x0625,0x0639,0x062F,0x0627,0x062F,0x0627,0x062A,0x0020,0x0627,0x0644,0x0645,0x0635,0x0646,0x0639,0x0000},//????? ??????? ??? ??????? ??????
															  #endif
															#else
															  #ifdef LANGUAGE_CN_ENABLE
																{0x6062,0x590D,0x5230,0x51FA,0x5382,0x8BBE,0x7F6E,0x0000},//恢复到出厂设置
															  #endif
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0074,0x006F,0x0020,0x0074,0x0068,0x0065,0x0020,0x0066,0x0061,0x0063,0x0074,0x006F,0x0072,0x0079,0x0020,0x0073,0x0065,0x0074,0x0074,0x0069,0x006E,0x0067,0x0073,0x0000},//Reset to the factory settings
															  #endif
															#endif	
															};
					
