duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_ICON_X, SETTINGS_MENU_RESET_ICON_Y, IMG_RESET_LOGO_ADDR);
					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_NO_X, SETTINGS_MENU_RESET_NO_Y, IMG_RESET_NO_ADDR);
					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_YES_X, SETTINGS_MENU_RESET_YES_Y, IMG_RESET_YES_ADDR);

					switch(global_settings.language)
					{
				   #if defined(LANGUAGE_DE_ENABLE)||defined(LANGUAGE_GR_ENABLE)
				   #ifdef LANGUAGE_DE_ENABLE
					case LANGUAGE_DE:
				   #endif
				   #ifdef LANGUAGE_GR_ENABLE
					case LANGUAGE_GR:
				   #endif
						mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_ready[global_settings.language], MENU_NOTIFY_STR_MAX-2);
						break;
				   #endif/*LANGUAGE_DE_ENABLE||LANGUAGE_GR_ENABLE*/
				   
				   #ifdef LANGUAGE_JP_ENABLE
					case LANGUAGE_JP:
						mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_ready[global_settings.language], MENU_NOTIFY_STR_MAX-18);
						break;
				   #endif
				  
					default:
						mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_ready[global_settings.language], MENU_NOTIFY_STR_MAX);
						break;
					}
					LCD_MeasureUniString(tmpbuf, &w, &h);

				  #ifdef LANGUAGE_AR_ENABLE	
					if(g_language_r2l)
						LCD_ShowUniStringRtoL(LCD_WIDTH-(SETTINGS_MENU_RESET_STR_X+(SETTINGS_MENU_RESET_STR_W-w)/2), 
										SETTINGS_MENU_RESET_STR_Y+(SETTINGS_MENU_RESET_STR_H-h)/2, 
										tmpbuf);
					else
				  #endif		
						LCD_ShowUniString(SETTINGS_MENU_RESET_STR_X+(SETTINGS_MENU_RESET_STR_W-w)/2, 
										SETTINGS_MENU_RESET_STR_Y+(SETTINGS_MENU_RESET_STR_H-h)/2, 
										tmpbuf);
				#ifdef CONFIG_TOUCH_SUPPORT
					register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
												SETTINGS_MENU_RESET_NO_X, 
												SETTINGS_MENU_RESET_NO_X+SETTINGS_MENU_RESET_NO_W, 
												SETTINGS_MENU_RESET_NO_Y, 
												SETTINGS_MENU_RESET_NO_Y+SETTINGS_MENU_RESET_NO_H, 
												settings_menu.sel_handler[0]);
					register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
												SETTINGS_MENU_RESET_YES_X, 
												SETTINGS_MENU_RESET_YES_X+SETTINGS_MENU_RESET_YES_W, 
												SETTINGS_MENU_RESET_YES_Y, 
												SETTINGS_MENU_RESET_YES_Y+SETTINGS_MENU_RESET_YES_H, 
												settings_menu.sel_handler[1]);
				#endif	
				}
				break;
				
			case RESET_STATUS_RUNNING:
				{
					uint16_t str_running[LANGUAGE_MAX][28] = {
															#ifndef FW_FOR_CN
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0074,0x0069,0x006E,0x0067,0x0020,0x0069,0x006E,0x0020,0x0070,0x0072,0x006F,0x0067,0x0072,0x0065,0x0073,0x0073,0x0000},//Resetting in progress
															  #endif
															  #ifdef LANGUAGE_DE_ENABLE
																{0x005A,0x0075,0x0072,0x00FC,0x0063,0x006B,0x0073,0x0065,0x0074,0x007A,0x0075,0x006E,0x0067,0x0020,0x006C,0x00E4,0x0075,0x0066,0x0074,0x0000},//Zurücksetzung l?uft
															  #endif
															  #ifdef LANGUAGE_FR_ENABLE
																{0x0052,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0069,0x0061,0x006C,0x0069,0x0073,0x0061,0x0074,0x0069,0x006F,0x006E,0x0020,0x0065,0x006E,0x0020,0x0063,0x006F,0x0075,0x0072,0x0073,0x0000},//Réinitialisation en cours
														      #endif
															  #ifdef LANGUAGE_IT_ENABLE
																{0x0052,0x0069,0x0070,0x0072,0x0069,0x0073,0x0074,0x0069,0x006E,0x0061,0x0020,0x0069,0x006E,0x0020,0x0063,0x006F,0x0072,0x0073,0x006F,0x0000},//Ripristina in corso
															  #endif
															  #ifdef LANGUAGE_ES_ENABLE
																{0x0052,0x0065,0x0069,0x006E,0x0069,0x0063,0x0069,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0065,0x006E,0x0020,0x0063,0x0075,0x0072,0x0073,0x006F,0x0000},//Reinicialización en curso
															  #endif
															  #ifdef LANGUAGE_PT_ENABLE
																{0x0052,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x00E7,0x00E3,0x006F,0x0020,0x0065,0x006D,0x0020,0x0061,0x006E,0x0064,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0000},//Redefini??o em andamento
															  #endif
															  #ifdef LANGUAGE_PL_ENABLE
																{0x0054,0x0072,0x0077,0x0061,0x0020,0x0072,0x0065,0x0073,0x0065,0x0074,0x006F,0x0077,0x0061,0x006E,0x0069,0x0065,0x0000},//Trwa resetowanie
															  #endif
															  #ifdef LANGUAGE_SE_ENABLE
																{0x00C5,0x0074,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,0x006C,0x0065,0x0072,0x0020,0x0070,0x00E5,0x0067,0x00E5,0x0072,0x002E,0x002E,0x002E,0x0000},//?terst?ller p?g?r...
															  #endif
															  #ifdef LANGUAGE_JP_ENABLE
																{0x30EA,0x30BB,0x30C3,0x30C8,0x4E2D,0x002E,0x002E,0x002E,0x0000},//リセット中...
															  #endif
															  #ifdef LANGUAGE_KR_ENABLE
																{0xC7AC,0xC124,0xC815,0x0020,0xC9C4,0xD589,0x0020,0xC911,0x0000},//??? ?? ?
															  #endif
															  #ifdef LANGUAGE_RU_ENABLE
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0020,0x0432,0x0020,0x043F,0x0440,0x043E,0x0446,0x0435,0x0441,0x0441,0x0435,0x0000},//Сброс в процессе
															  #endif
															  #ifdef LANGUAGE_AR_ENABLE
																{0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0627,0x0644,0x0636,0x0628,0x0637,0x0020,0x0642,0x064A,0x062F,0x0020,0x0627,0x0644,0x062A,0x0642,0x062F,0x0645,0x0000},//????? ????? ??? ??????
															  #endif
															#else
															  #ifdef LANGUAGE_CN_ENABLE
																{0x91CD,0x7F6E,0x8FDB,0x884C,0x4E2D,0x0000},//重置进行中
															  #endif
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0074,0x0069,0x006E,0x0067,0x0020,0x0069,0x006E,0x0020,0x0070,0x0072,0x006F,0x0067,0x0072,0x0065,0x0073,0x0073,0x0000},//Resetting in progress
															  #endif
															#endif
															  };
					uint32_t img_addr[8] = {
											IMG_RESET_ANI_1_ADDR,
											IMG_RESET_ANI_2_ADDR,
											IMG_RESET_ANI_3_ADDR,
											IMG_RESET_ANI_4_ADDR,
											IMG_RESET_ANI_5_ADDR,
											IMG_RESET_ANI_6_ADDR,
											IMG_RESET_ANI_7_ADDR,
											IMG_RESET_ANI_8_ADDR
										};

					mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_running[global_settings.language], MENU_NOTIFY_STR_MAX);
					LCD_MeasureUniString(tmpbuf, &w, &h);

