duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
				  #ifdef LANGUAGE_AR_ENABLE	
					if(g_language_r2l)
						LCD_ShowUniStringRtoL(LCD_WIDTH-(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2), 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
					else
				  #endif		
						LCD_ShowUniString(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2, 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
				#ifdef CONFIG_ANIMATION_SUPPORT
					AnimaShow(SETTINGS_MENU_RESET_LOGO_X, SETTINGS_MENU_RESET_LOGO_Y, img_addr, ARRAY_SIZE(img_addr), 300, true, NULL);
				#endif	
				}
				break;
				
			case RESET_STATUS_SUCCESS:
				{
					uint16_t str_success[LANGUAGE_MAX][26] = {
															#ifndef FW_FOR_CN
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0043,0x006F,0x006D,0x0070,0x006C,0x0065,0x0074,0x0065,0x0064,0x0000},//Reset Completed
															  #endif
															  #ifdef LANGUAGE_DE_ENABLE
																{0x005A,0x0075,0x0072,0x00FC,0x0063,0x006B,0x0073,0x0065,0x0074,0x007A,0x0065,0x006E,0x0020,0x0065,0x0072,0x0066,0x006F,0x006C,0x0067,0x0072,0x0065,0x0069,0x0063,0x0068,0x0000},//Zurücksetzen erfolgreich
															  #endif
															  #ifdef LANGUAGE_FR_ENABLE
																{0x0052,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0069,0x0061,0x006C,0x0069,0x0073,0x0061,0x0074,0x0069,0x006F,0x006E,0x0020,0x0072,0x00E9,0x0075,0x0073,0x0073,0x0069,0x0065,0x0000},//Réinitialisation réussie
															  #endif
															  #ifdef LANGUAGE_IT_ENABLE
																{0x0052,0x0069,0x0070,0x0072,0x0069,0x0073,0x0074,0x0069,0x006E,0x006F,0x0020,0x0072,0x0069,0x0075,0x0073,0x0063,0x0069,0x0074,0x006F,0x0000},//Ripristino riuscito
															  #endif
															  #ifdef LANGUAGE_ES_ENABLE
																{0x0052,0x0065,0x0073,0x0074,0x0061,0x0062,0x006C,0x0065,0x0063,0x0069,0x006D,0x0069,0x0065,0x006E,0x0074,0x006F,0x0020,0x00E9,0x0078,0x0069,0x0074,0x006F,0x0000},//Restablecimiento éxito
															  #endif
															  #ifdef LANGUAGE_PT_ENABLE
																{0x0052,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x00E7,0x00E3,0x006F,0x0020,0x0062,0x0065,0x006D,0x2013,0x0073,0x0075,0x0063,0x0065,0x0064,0x0069,0x0064,0x0061,0x0000},//Redefini??o bem-sucedida
															  #endif
															  #ifdef LANGUAGE_PL_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x007A,0x0061,0x006B,0x006F,0x0144,0x0063,0x007A,0x006F,0x006E,0x0079,0x0000},//Reset zakończony
															  #endif
															  #ifdef LANGUAGE_SE_ENABLE
																{0x00C5,0x0074,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,0x006C,0x006E,0x0069,0x006E,0x0067,0x0020,0x0073,0x006C,0x0075,0x0074,0x0066,0x00F6,0x0072,0x0064,0x0021,0x0000},//?terst?llning slutf?rd!
															  #endif
															  #ifdef LANGUAGE_JP_ENABLE
																{0x30EA,0x30BB,0x30C3,0x30C8,0x6210,0x529F,0x0000},//リセット成功
															  #endif
															  #ifdef LANGUAGE_KR_ENABLE
																{0xBCF5,0xAD6C,0x0020,0xCD08,0xAE30,0xD654,0x0020,0xC131,0xACF5,0x0000},//?? ??? ??
															  #endif
															  #ifdef LANGUAGE_RU_ENABLE
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0020,0x0432,0x044B,0x043F,0x043E,0x043B,0x043D,0x0435,0x043D,0x0000},//Сброс выполнен
															  #endif
															  #ifdef LANGUAGE_AR_ENABLE
																{0x062A,0x0645,0x062A,0x0020,0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0627,0x0644,0x0636,0x0628,0x0637,0x0020,0x0628,0x0646,0x062C,0x0627,0x062D,0x0000},//??? ????? ????? ?????
															  #endif
															#else
															  #ifdef LANGUAGE_CN_ENABLE
																{0x51FA,0x5382,0x8BBE,0x7F6E,0x6062,0x590D,0x6210,0x529F,0x0000},//出厂设置恢复成功
															  #endif
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0043,0x006F,0x006D,0x0070,0x006C,0x0065,0x0074,0x0065,0x0064,0x0000},//Reset Completed
															  #endif
															#endif
															  };
					
				#ifdef CONFIG_ANIMATION_SUPPORT
					AnimaStop();
				#endif

					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_LOGO_X, SETTINGS_MENU_RESET_LOGO_Y, IMG_RESET_SUCCESS_ADDR);

					mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_success[language_bk], MENU_NOTIFY_STR_MAX);
					LCD_MeasureUniString(tmpbuf, &w, &h);

				  #ifdef LANGUAGE_AR_ENABLE	
					if(g_language_r2l)
						LCD_ShowUniStringRtoL(LCD_WIDTH-(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2), 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
					else
				  #endif
						LCD_ShowUniString(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2, 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
				}
				break;
				
			case RESET_STATUS_FAIL:
				{
					uint16_t str_fail[LANGUAGE_MAX][30] = {
															#ifndef FW_FOR_CN
														      #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0046,0x0061,0x0069,0x006C,0x0065,0x0064,0x0000},//Reset Failed
															  #endif
															  #ifdef LANGUAGE_DE_ENABLE
																{0x005A,0x0075,0x0072,0x00FC,0x0063,0x006B,0x0073,0x0065,0x0074,0x007A,0x0065,0x006E,0x0020,0x0066,0x0065,0x0068,0x006C,0x0067,0x0065,0x0073,0x0063,0x0068,0x006C,0x0061,0x0067,0x0065,0x006E,0x0000},//Zurücksetzen fehlgeschlagen
															  #endif
															  #ifdef LANGUAGE_FR_ENABLE
																{0x00C9,0x0063,0x0068,0x0065,0x0063,0x0020,0x0064,0x0065,0x0020,0x006C,0x0061,0x0020,0x0072,0x00E9,0x0069,0x006E,0x0069,0x0074,0x0069,0x0061,0x006C,0x0069,0x0073,0x0061,0x0074,0x0069,0x006F,0x006E,0x0000},//échec de la réinitialisation
															  #endif
															  #ifdef LANGUAGE_IT_ENABLE
																{0x0052,0x0069,0x0070,0x0072,0x0069,0x0073,0x0074,0x0069,0x006E,0x006F,0x0020,0x0066,0x0061,0x006C,0x006C,0x0069,0x0074,0x006F,0x0000},//Ripristino fallito
															  #endif
															  #ifdef LANGUAGE_ES_ENABLE
																{0x0052,0x0065,0x0073,0x0074,0x0061,0x0062,0x006C,0x0065,0x0063,0x0069,0x006D,0x0069,0x0065,0x006E,0x0074,0x006F,0x0020,0x0066,0x0061,0x006C,0x006C,0x0069,0x0064,0x006F,0x0000},//Restablecimiento fallido
															  #endif
															  #ifdef LANGUAGE_PT_ENABLE
																{0x0046,0x0061,0x006C,0x0068,0x0061,0x0020,0x006E,0x0061,0x0020,0x0072,0x0065,0x0064,0x0065,0x0066,0x0069,0x006E,0x0069,0x00E7,0x00E3,0x006F,0x0000},//Falha na redefini??o
															  #endif
															  #ifdef LANGUAGE_PL_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x006E,0x0069,0x0065,0x0075,0x0064,0x0061,0x006E,0x0079,0x0000},//Reset nieudany
															  #endif
															  #ifdef LANGUAGE_SE_ENABLE
																{0x00C5,0x0074,0x0065,0x0072,0x0073,0x0074,0x00E4,0x006C,0x006C,0x006E,0x0069,0x006E,0x0067,0x0020,0x006D,0x0069,0x0073,0x0073,0x006C,0x0079,0x0063,0x006B,0x0061,0x0064,0x0065,0x0073,0x0021,0x0000},//?terst?llning misslyckades!
															  #endif
															  #ifdef LANGUAGE_JP_ENABLE
																{0x30EA,0x30BB,0x30C3,0x30C8,0x5931,0x6557,0x0000},//リセット失敗
															  #endif
															  #ifdef LANGUAGE_KR_ENABLE
																{0xBCF5,0xAD6C,0x0020,0xCD08,0xAE30,0xD654,0x0020,0xC2E4,0xD328,0x0000},//?? ??? ??
															  #endif
															  #ifdef LANGUAGE_RU_ENABLE
																{0x0421,0x0431,0x0440,0x043E,0x0441,0x0020,0x043D,0x0435,0x0020,0x0443,0x0434,0x0430,0x043B,0x0441,0x044F,0x0000},//Сброс не удался
															  #endif
															  #ifdef LANGUAGE_AR_ENABLE
																{0x0641,0x0634,0x0644,0x062A,0x0020,0x0625,0x0639,0x0627,0x062F,0x0629,0x0020,0x0627,0x0644,0x062A,0x0639,0x064A,0x064A,0x0646,0x0000},//???? ????? ???????
															  #endif
															#else
															  #ifdef LANGUAGE_CN_ENABLE
																{0x51FA,0x5382,0x8BBE,0x7F6E,0x6062,0x590D,0x5931,0x8D25,0x0000},//出厂设置恢复失败
															  #endif
															  #ifdef LANGUAGE_EN_ENABLE
																{0x0052,0x0065,0x0073,0x0065,0x0074,0x0020,0x0046,0x0061,0x0069,0x006C,0x0065,0x0064,0x0000},//Reset Failed
															  #endif
															#endif
														   };

				#ifdef CONFIG_ANIMATION_SUPPORT
					AnimaStop();
				#endif

					LCD_ShowImg_From_Flash(SETTINGS_MENU_RESET_LOGO_X, SETTINGS_MENU_RESET_LOGO_Y, IMG_RESET_FAIL_ADDR);

