duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
					mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_fail[language_bk], MENU_NOTIFY_STR_MAX);
					LCD_MeasureUniString(tmpbuf, &w, &h);

				#ifdef LANGUAGE_AR_ENABLE	
					if(g_language_r2l)
						LCD_ShowUniStringRtoL(LCD_WIDTH-(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2), 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
					else
				#endif
						LCD_ShowUniString(SETTINGS_MENU_RESET_NOTIFY_X+(SETTINGS_MENU_RESET_NOTIFY_W-w)/2, 
										SETTINGS_MENU_RESET_NOTIFY_Y+(SETTINGS_MENU_RESET_NOTIFY_H-h)/2, 
										tmpbuf);
					language_bk = LANGUAGE_MAX;
				}
				break;
			}
		}
		break;
		
	case SETTINGS_MENU_OTA:
		{
			uint16_t tmpbuf[128] = {0};
			uint16_t str_notify[LANGUAGE_MAX][30] = {
													#ifndef FW_FOR_CN
													  #ifdef LANGUAGE_EN_ENABLE
														{0x0049,0x0074,0x0020,0x0069,0x0073,0x0020,0x0074,0x0068,0x0065,0x0020,0x006C,0x0061,0x0074,0x0065,0x0073,0x0074,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x002E,0x0000},//It is the latest version.
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														{0x0045,0x0073,0x0020,0x0069,0x0073,0x0074,0x0020,0x0064,0x0069,0x0065,0x0020,0x006E,0x0065,0x0075,0x0065,0x0073,0x0074,0x0065,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x002E,0x0000},//Es ist die neueste version.
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														{0x0043,0x0027,0x0065,0x0073,0x0074,0x0020,0x006C,0x0061,0x0020,0x0064,0x0065,0x0072,0x006E,0x0069,0x00E8,0x0072,0x0065,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x002E,0x0000},//C'est la dernière version.
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														{0x00C8,0x0020,0x006C,0x0027,0x0075,0x006C,0x0074,0x0069,0x006D,0x0061,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0065,0x002E,0x0000},//? l'ultima versione.
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														{0x0045,0x0073,0x0020,0x006C,0x0061,0x0020,0x00FA,0x006C,0x0074,0x0069,0x006D,0x0061,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x00F3,0x006E,0x002E,0x0000},//Es la última versión.
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														{0x00C9,0x0020,0x0061,0x0020,0x0076,0x0065,0x0072,0x0073,0x00E3,0x006F,0x0020,0x006D,0x0061,0x0069,0x0073,0x0020,0x0072,0x0065,0x0063,0x0065,0x006E,0x0074,0x0065,0x002E,0x0000},//? a vers?o mais recente.
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														{0x004D,0x0061,0x0073,0x007A,0x0020,0x006E,0x0061,0x006A,0x006E,0x006F,0x0077,0x0020,0x0077,0x0065,0x0072,0x0073,0x006A,0x0119,0x002E,0x0000},//Masz najnow wersj?.
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														{0x0044,0x0065,0x0074,0x0020,0x00E4,0x0072,0x0020,0x0064,0x0065,0x006E,0x0020,0x0073,0x0065,0x006E,0x0061,0x0073,0x0074,0x0065,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0065,0x006E,0x002E,0x0000},//Det ?r den senaste versionen.
													  #endif
													  #ifdef LANGUAGE_JP_ENABLE
														{0x6700,0x65B0,0x30D0,0x30FC,0x30B8,0x30E7,0x30F3,0x3067,0x3059,0x3002,0x0000},//最新バージョンです。
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														{0xCD5C,0xC2E0,0x0020,0xBC84,0xC804,0xC785,0xB2C8,0xB2E4,0x002E,0x0000},//?? ?????.
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														{0x042D,0x0442,0x043E,0x0020,0x043F,0x043E,0x0441,0x043B,0x0435,0x0434,0x043D,0x044F,0x044F,0x0020,0x0432,0x0435,0x0440,0x0441,0x0438,0x044F,0x002E,0x0000},//Это последняя версия.
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														{0x0647,0x0630,0x0627,0x0020,0x0647,0x0648,0x0020,0x0627,0x0644,0x0625,0x0635,0x062F,0x0627,0x0631,0x0020,0x0627,0x0644,0x0623,0x062D,0x062F,0x062B,0x0000},//??? ?? ??????? ??????
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														{0x5DF2,0x662F,0x6700,0x65B0,0x7248,0x672C,0x0000},//已是最新版本
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														{0x0049,0x0074,0x0020,0x0069,0x0073,0x0020,0x0074,0x0068,0x0065,0x0020,0x006C,0x0061,0x0074,0x0065,0x0073,0x0074,0x0020,0x0076,0x0065,0x0072,0x0073,0x0069,0x006F,0x006E,0x0000},//It is the latest version
													  #endif
													#endif
													};
			
			LCD_Clear(BLACK);
			LCD_SetFontBgColor(BLACK);

			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			
		#ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
				LCD_ShowUniStringRtoL(LCD_WIDTH-(LCD_WIDTH-w)/2, (LCD_HEIGHT-h)/2, tmpbuf);
			else
		#endif
				LCD_ShowUniString((LCD_WIDTH-w)/2, (LCD_HEIGHT-h)/2, tmpbuf);

		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
										0, 
										LCD_WIDTH, 
										0, 
										LCD_HEIGHT, 
										settings_menu.sel_handler[0]);
		#endif	
		}
		break;
		
	case SETTINGS_MENU_BRIGHTNESS:
		{
			uint32_t img_addr[4] = {IMG_BKL_LEVEL_1_ADDR,IMG_BKL_LEVEL_2_ADDR,IMG_BKL_LEVEL_3_ADDR,IMG_BKL_LEVEL_4_ADDR};

			if(entry_setting_bk_flag == false)
			{
				entry_setting_bk_flag = true;
				LCD_Clear(BLACK);
				LCD_ShowImg_From_Flash(SETTINGS_MENU_BK_DEC_X, SETTINGS_MENU_BK_DEC_Y, IMG_BKL_DEC_ICON_ADDR);
				LCD_ShowImg_From_Flash(SETTINGS_MENU_BK_INC_X, SETTINGS_MENU_BK_INC_Y, IMG_BKL_INC_ICON_ADDR);
			}
			
			LCD_ShowImg_From_Flash(SETTINGS_MENU_BK_LEVEL_X, SETTINGS_MENU_BK_LEVEL_Y, img_addr[global_settings.backlight_level]);

		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
										SETTINGS_MENU_BK_DEC_X, 
										SETTINGS_MENU_BK_DEC_X+SETTINGS_MENU_BK_DEC_W, 
										SETTINGS_MENU_BK_DEC_Y, 
										SETTINGS_MENU_BK_DEC_Y+SETTINGS_MENU_BK_DEC_H, 
										settings_menu.sel_handler[0]
										);
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
										SETTINGS_MENU_BK_INC_X, 
										SETTINGS_MENU_BK_INC_X+SETTINGS_MENU_BK_INC_W, 
										SETTINGS_MENU_BK_INC_Y, 
										SETTINGS_MENU_BK_INC_Y+SETTINGS_MENU_BK_INC_H, 
										settings_menu.sel_handler[1]
										);
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
										0, 
										LCD_WIDTH, 
										0, 
										SETTINGS_MENU_BK_INC_Y-10, 
										settings_menu.sel_handler[2]
										);			
		
			register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.pg_handler[2]);
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.pg_handler[3]);
		#endif
		}
		break;
		
	case SETTINGS_MENU_TEMP:
		{
			LCD_Clear(BLACK);
			LCD_SetFontColor(WHITE);
			
			for(i=0;i<settings_menu.count;i++)
			{
				uint16_t tmpbuf[128] = {0};
				
				LCD_ShowImg_From_Flash(SETTINGS_MENU_BG_X, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y), IMG_SET_INFO_BG_ADDR);

