duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
				if(i == global_settings.temp_unit)
				{
				#ifdef LANGUAGE_AR_ENABLE
					if(g_language_r2l)
						LCD_ShowImg_From_Flash(LCD_WIDTH-(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X)-SETTINGS_MENU_SEL_DOT_W, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_YES_ADDR);
					else
				#endif
						LCD_ShowImg_From_Flash(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_YES_ADDR);
				}
				else
				{
				#ifdef LANGUAGE_AR_ENABLE
					if(g_language_r2l)
						LCD_ShowImg_From_Flash(LCD_WIDTH-(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X)-SETTINGS_MENU_SEL_DOT_W, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_NO_ADDR);
					else
				#endif		
						LCD_ShowImg_From_Flash(SETTINGS_MENU_BG_X+SETTINGS_MENU_SEL_DOT_X, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_SEL_DOT_Y, IMG_SELECT_ICON_NO_ADDR);
				}
				
			#ifdef FONTMAKER_UNICODE_FONT
				mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)settings_menu.name[global_settings.language][i], MENU_NAME_STR_MAX);
				LCD_MeasureUniString(tmpbuf, &w, &h);
			  #ifdef LANGUAGE_AR_ENABLE	
				if(g_language_r2l)
					LCD_ShowUniStringRtoL(LCD_WIDTH-(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X),
										SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+(SETTINGS_MENU_BG_H-h)/2,
										tmpbuf);
				else
			  #endif
					LCD_ShowUniString(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X,
										SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+(SETTINGS_MENU_BG_H-h)/2,
										tmpbuf);
			#endif

			#ifdef CONFIG_TOUCH_SUPPORT
				register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
											SETTINGS_MENU_BG_X, 
											SETTINGS_MENU_BG_X+SETTINGS_MENU_BG_W, 
											SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y), 
											SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_BG_H, 
											settings_menu.sel_handler[i]);
			#endif
			}
		}
		break;
		
	case SETTINGS_MENU_DEVICE:
		{
			uint16_t imei_str[IMEI_MAX_LEN+1] = {0};
			uint16_t imsi_str[IMSI_MAX_LEN+1] = {0};
			uint16_t mcu_str[20] = {0x0000};
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			uint16_t iccid_str[ICCID_MAX_LEN+1] = {0};
			uint16_t modem_str[20] = {0x0000};	
			uint16_t ppg_str[20] = {0x0000};
			uint16_t wifi_str[20] = {0x0000};
			uint16_t ble_str[20] = {0x0000};
			uint16_t ble_mac_str[64] = {0};
			uint16_t *menu_sle_str[9] = {imei_str,imsi_str,iccid_str,mcu_str,modem_str,ppg_str,wifi_str,ble_str,ble_mac_str};
		#else
			uint16_t *menu_sle_str[3] = {imei_str,imsi_str,mcu_str};
		#endif
			uint16_t menu_color = 0x9CD3;

			LCD_Clear(BLACK);

			mmi_asc_to_ucs2((uint8_t*)imei_str, g_imei);
			mmi_asc_to_ucs2((uint8_t*)imsi_str, g_imsi);
			mmi_asc_to_ucs2((uint8_t*)mcu_str, g_fw_version);
		#ifdef CONFIG_FACTORY_TEST_SUPPORT
			mmi_asc_to_ucs2((uint8_t*)iccid_str, g_iccid);
			mmi_asc_to_ucs2((uint8_t*)modem_str, &g_modem[12]);	
		  #ifdef CONFIG_PPG_SUPPORT	
			mmi_asc_to_ucs2((uint8_t*)ppg_str, g_ppg_ver);
		  #else
			mmi_asc_to_ucs2((uint8_t*)ppg_str, "NO");
		  #endif
		  #ifdef CONFIG_WIFI_SUPPORT
			mmi_asc_to_ucs2((uint8_t*)wifi_str, g_wifi_ver);
		  #else
			mmi_asc_to_ucs2((uint8_t*)wifi_str, "NO");
		  #endif
			mmi_asc_to_ucs2((uint8_t*)ble_str, &g_nrf52810_ver[15]);
			mmi_asc_to_ucs2((uint8_t*)ble_mac_str, g_ble_mac_addr);
		#endif
		
			if(settings_menu.count > SETTINGS_SUB_MENU_MAX_PER_PG)
				count = (settings_menu.count - settings_menu.index >= SETTINGS_SUB_MENU_MAX_PER_PG) ? SETTINGS_SUB_MENU_MAX_PER_PG : settings_menu.count - settings_menu.index;
			else
				count = settings_menu.count;
			
			for(i=0;i<count;i++)
			{
				LCD_ShowImg_From_Flash(SETTINGS_MENU_BG_X, SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y), IMG_SET_INFO_BG_ADDR);

			#ifdef FONTMAKER_UNICODE_FONT
				LCD_SetFontColor(menu_color);
				LCD_SetFontSize(FONT_SIZE_20);
				LCD_ShowUniString(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X,
									SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_STR_OFFSET_Y-5,
									settings_menu.name[global_settings.language][i+settings_menu.index]);

				LCD_SetFontColor(WHITE);
			  #ifdef CONFIG_FACTORY_TEST_SUPPORT	
				if((settings_menu.index == 0) && (i == 2))
					LCD_SetFontSize(FONT_SIZE_16);
			  #endif
			  	LCD_ShowUniString(SETTINGS_MENU_BG_X+SETTINGS_MENU_STR_OFFSET_X,
									SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_STR_OFFSET_Y+15,
									menu_sle_str[i+settings_menu.index]);
			#endif

			#ifdef CONFIG_TOUCH_SUPPORT
				register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 
											SETTINGS_MENU_BG_X, 
											SETTINGS_MENU_BG_X+SETTINGS_MENU_BG_W, 
											SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y), 
											SETTINGS_MENU_BG_Y+i*(SETTINGS_MENU_BG_H+SETTINGS_MENU_BG_OFFSET_Y)+SETTINGS_MENU_BG_H, 
											settings_menu.sel_handler[i+settings_menu.index]);
			#endif
			}
		}
		break;
		
	case SETTINGS_MENU_CAREMATE_QR:
		{
			uint16_t tmpbuf[128] = {0};
			uint16_t str_notify[LANGUAGE_MAX][35] = {
													#ifndef FW_FOR_CN
													  #ifdef LANGUAGE_EN_ENABLE
														{0x0049,0x0074,0x0020,0x0069,0x0073,0x0020,0x0062,0x0065,0x0069,0x006E,0x0067,0x0020,0x0064,0x0065,0x0076,0x0065,0x006C,0x006F,0x0070,0x0065,0x0064,0x002E,0x0000},//It is being developed.
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														{0x0045,0x0073,0x0020,0x0077,0x0069,0x0072,0x0064,0x0020,0x0065,0x006E,0x0074,0x0077,0x0069,0x0063,0x006B,0x0065,0x006C,0x0074,0x002E,0x0000},//Es wird entwickelt.
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														{0x0049,0x006C,0x0020,0x0065,0x0073,0x0074,0x0020,0x0065,0x006E,0x0020,0x0063,0x006F,0x0075,0x0072,0x0073,0x0020,0x0064,0x0065,0x0020,0x0064,0x00E9,0x0076,0x0065,0x006C,0x006F,0x0070,0x0070,0x0065,0x006D,0x0065,0x006E,0x0074,0x002E,0x0000},//Il est en cours de développement.
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														{0x00C8,0x0020,0x0069,0x006E,0x0020,0x0066,0x0061,0x0073,0x0065,0x0020,0x0064,0x0069,0x0020,0x0073,0x0076,0x0069,0x006C,0x0075,0x0070,0x0070,0x006F,0x002E,0x0000},//? in fase di sviluppo.
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														{0x0045,0x0073,0x0074,0x00E1,0x0020,0x0065,0x006E,0x0020,0x0064,0x0065,0x0073,0x0061,0x0072,0x0072,0x006F,0x006C,0x006C,0x006F,0x002E,0x0000},//Está en desarrollo.
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														{0x0045,0x0073,0x0074,0x00E1,0x0020,0x0061,0x0020,0x0073,0x0065,0x0072,0x0020,0x0064,0x0065,0x0073,0x0065,0x006E,0x0076,0x006F,0x006C,0x0076,0x0069,0x0064,0x006F,0x002E,0x0000},//Está a ser desenvolvido.
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														{0x004A,0x0065,0x0073,0x0074,0x0020,0x0077,0x0020,0x0074,0x0072,0x0061,0x006B,0x0063,0x0069,0x0065,0x0020,0x006F,0x0070,0x0072,0x0061,0x0063,0x006F,0x0077,0x0079,0x0077,0x0061,0x006E,0x0069,0x0061,0x002E,0x0000},//Jest w trakcie opracowywania.
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														{0x0044,0x0065,0x0074,0x0020,0x0068,0x00E5,0x006C,0x006C,0x0065,0x0072,0x0020,0x0070,0x00E5,0x0020,0x0061,0x0074,0x0074,0x0020,0x0075,0x0074,0x0076,0x0065,0x0063,0x006B,0x006C,0x0061,0x0073,0x002E,0x0000},//Det h?ller p? att utvecklas.
													  #endif
													  #ifdef LANGUAGE_JP_ENABLE
														{0x958B,0x767A,0x4E2D,0x3067,0x3059,0x3002,0x0000},//開発中です。
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														{0xAC1C,0xBC1C,0x0020,0xC911,0xC785,0xB2C8,0xB2E4,0x002E,0x0000},//?? ????.
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														{0x041E,0x043D,0x0020,0x043D,0x0430,0x0445,0x043E,0x0434,0x0438,0x0442,0x0441,0x044F,0x0020,0x0432,0x0020,0x0441,0x0442,0x0430,0x0434,0x0438,0x0438,0x0020,0x0440,0x0430,0x0437,0x0440,0x0430,0x0431,0x043E,0x0442,0x043A,0x0438,0x002E,0x0000},//Он находится в стадии разработки.
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														{0x062C,0x0627,0x0631,0x064A,0x0020,0x062A,0x0637,0x0648,0x064A,0x0631,0x0647,0x002E,0x0000},//???? ??????.
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														{0x6B64,0x529F,0x80FD,0x6B63,0x5728,0x5F00,0x53D1,0x3002,0x0000},//此功能正在开发。
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														{0x0049,0x0074,0x0020,0x0069,0x0073,0x0020,0x0062,0x0065,0x0069,0x006E,0x0067,0x0020,0x0064,0x0065,0x0076,0x0065,0x006C,0x006F,0x0070,0x0065,0x0064,0x002E,0x0000},//It is being developed.
													  #endif
													#endif
													}; 
			LCD_Clear(BLACK);
			LCD_ReSetFontBgColor();
			LCD_ReSetFontColor();

		#ifdef CONFIG_QRCODE_SUPPORT
			sprintf(tmpbuf, "%s%s", SETTINGS_CAREMATE_URL, g_imei);
			show_QR_code(strlen(tmpbuf), tmpbuf);
		#else
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStringRtoL(LCD_WIDTH-(LCD_WIDTH-w)/2, (LCD_HEIGHT-h)/2, tmpbuf);
			else
		  #endif
				LCD_ShowUniString((LCD_WIDTH-w)/2, (LCD_HEIGHT-h)/2, tmpbuf);
		#endif/*CONFIG_QRCODE_SUPPORT*/
		
		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.sel_handler[0]);
			register_touch_event_handle(TP_EVENT_MOVING_UP, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.sel_handler[0]);
			register_touch_event_handle(TP_EVENT_MOVING_DOWN, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.sel_handler[0]);
			register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.sel_handler[0]);
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, settings_menu.sel_handler[0]);
		#endif
		}
		break;
	}

	if(settings_menu.count > SETTINGS_MAIN_MENU_MAX_PER_PG)
	{		
		if(settings_menu.count > 5*SETTINGS_MAIN_MENU_MAX_PER_PG)
		{
			uint32_t page6_img[6] = {IMG_SET_PG6_1_ADDR,IMG_SET_PG6_2_ADDR,IMG_SET_PG6_3_ADDR,IMG_SET_PG6_4_ADDR,IMG_SET_PG6_5_ADDR,IMG_SET_PG6_6_ADDR};

