duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
		ppg_retry_left--;
		if(ppg_retry_left == 0)
		{
			switch(global_settings.language)
			{
		#if defined(LANGUAGE_JP_ENABLE)||defined(LANGUAGE_KR_ENABLE)
		  #ifdef LANGUAGE_JP_ENABLE
			case LANGUAGE_JP:
		  #endif
		  #ifdef LANGUAGE_KR_ENABLE
			case LANGUAGE_KR:
		  #endif
				mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)Incon_1_str[global_settings.language], 14);
				break;
		#endif/*LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
		  
			default:
				mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)Incon_1_str[global_settings.language], MENU_NOTIFY_STR_MAX-7);
				break;
			}
		}
		else
		{
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)Incon_2_str[global_settings.language], MENU_NOTIFY_STR_MAX-7);
		}
		LCD_MeasureUniString(tmpbuf,&w,&h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStringRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, tmpbuf);
		else
	#endif		
			LCD_ShowUniString(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, tmpbuf);

		k_timer_start(&ppg_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
		
	case PPG_STATUS_NOTIFY:
		LCD_Fill(BP_NOTIFY_X, BP_NOTIFY_Y, BP_NOTIFY_W, BP_NOTIFY_H, BLACK);
		LCD_ShowImg_From_Flash(BP_ICON_X, BP_ICON_Y, IMG_BP_BIG_ICON_3_ADDR);
	#ifdef FONTMAKER_UNICODE_FONT
		LCD_SetFontSize(FONT_SIZE_28);
	#else	
		LCD_SetFontSize(FONT_SIZE_24);
	#endif

		switch(global_settings.language)
		{
	   #ifdef LANGUAGE_JP_ENABLE
		case LANGUAGE_JP:
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)still_retry_str[global_settings.language], 10);
			break;
	   #endif
	  
		default:
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)still_retry_str[global_settings.language], MENU_NOTIFY_STR_MAX-12);
			break;
		}

		LCD_MeasureUniString(tmpbuf, &w, &h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStringRtoL(BP_NOTIFY_X+(BP_NOTIFY_W+w)/2, BP_NOTIFY_Y, tmpbuf);
		else
	#endif		
			LCD_ShowUniString(BP_NOTIFY_X+(BP_NOTIFY_W-w)/2, BP_NOTIFY_Y, tmpbuf);

		k_timer_start(&ppg_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
	}
#endif/*UI_STYLE_HEALTH_BAR*/
}

void BPShowStatus(void)
{
	uint16_t i,x,y,w,h;
	uint8_t tmpbuf[128] = {0};
	bpt_rec2_nod *p_bpt;
	bpt_data bpt_max={0},bpt_min={0};
	uint16_t title_str[LANGUAGE_MAX][22] = {
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0042,0x006C,0x006F,0x006F,0x0064,0x0020,0x0050,0x0072,0x0065,0x0073,0x0073,0x0075,0x0072,0x0065,0x0000},//Blood Pressure
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												{0x0042,0x006C,0x0075,0x0074,0x0064,0x0072,0x0075,0x0063,0x006B,0x0000},//Blutdruck
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												{0x0050,0x0072,0x0065,0x0073,0x0073,0x0069,0x006F,0x006E,0x0020,0x0061,0x0072,0x0074,0x00E9,0x0072,0x0069,0x0065,0x006C,0x006C,0x0065,0x0000},//Pression art閞ielle
											  #endif
											  #ifdef LANGUAGE_IT_ENABLE
												{0x0050,0x0072,0x0065,0x0073,0x0073,0x0069,0x006F,0x006E,0x0065,0x0020,0x0053,0x0061,0x006E,0x0067,0x0075,0x0069,0x0067,0x006E,0x0061,0x0000},//Pressione Sanguigna
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												{0x0050,0x0072,0x0065,0x0073,0x0069,0x00F3,0x006E,0x0020,0x0061,0x0072,0x0074,0x0065,0x0072,0x0069,0x0061,0x006C,0x0000},//Presi髇 arterial
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												{0x0050,0x0072,0x0065,0x0073,0x0073,0x00E3,0x006F,0x0020,0x0061,0x0072,0x0074,0x0065,0x0072,0x0069,0x0061,0x006C,0x0000},//Press鉶 arterial
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												{0x0043,0x0069,0x015B,0x002E,0x0020,0x006B,0x0072,0x0077,0x0069,0x0000},//Ci?. krwi
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												{0x0042,0x006C,0x006F,0x0064,0x0074,0x0072,0x0079,0x0063,0x006B,0x0000},//Blodtryck
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												{0x8840,0x5727,0x0000},//血圧
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												{0xD608,0xC555,0x0000},//??
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												{0x0410,0x0414,0x0000},//АД
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												{0x0636,0x063A,0x0637,0x0020,0x0627,0x0644,0x062F,0x0645,0x0000},//??? ????
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												{0x8840,0x538B,0x0000},//血压
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0042,0x006C,0x006F,0x006F,0x0064,0x0020,0x0050,0x0072,0x0065,0x0073,0x0073,0x0075,0x0072,0x0065,0x0000},//Blood Pressure
											  #endif
											#endif
											};

#ifdef UI_STYLE_HEALTH_BAR
	LCD_ShowImg_From_Flash(BP_ICON_X, BP_ICON_Y, IMG_BP_ICON_ANI_2_ADDR);
	LCD_ShowImg_From_Flash(BP_BG_X, BP_BG_Y, IMG_BP_BG_ADDR);
	LCD_ShowImg_From_Flash(BP_UNIT_X, BP_UNIT_Y, IMG_BP_UNIT_ADDR);
	LCD_ShowImg_From_Flash(BP_UP_ARRAW_X, BP_UP_ARRAW_Y, IMG_BP_UP_ARRAW_ADDR);
	LCD_ShowImg_From_Flash(BP_DOWN_ARRAW_X, BP_DOWN_ARRAW_Y, IMG_BP_DOWN_ARRAW_ADDR);

	memset(&ppgdata, 0x00, sizeof(ppgdata));
	GetCurDayBptRecData(&ppgdata);
	p_bpt = (bpt_rec2_nod*)&ppgdata;
	for(i=0;i<PPG_REC2_MAX_DAILY;i++)
	{
		if(p_bpt->year == 0x0000 
			|| p_bpt->month == 0x00 
			|| p_bpt->day == 0x00
			)
		{
			break;
		}
		
		if((p_bpt->bpt.systolic >= PPG_BPT_SYS_MIN) && (p_bpt->bpt.systolic <= PPG_BPT_SYS_MAX)
			&& (p_bpt->bpt.diastolic >= PPG_BPT_DIA_MIN) && (p_bpt->bpt.diastolic >= PPG_BPT_DIA_MIN)
			)
		{
			LCD_Fill(BP_REC_DATA_X+BP_REC_DATA_OFFSET_X*p_bpt->hour, BP_REC_DATA_Y-(p_bpt->bpt.systolic-30)*15/30, BP_REC_DATA_W, (p_bpt->bpt.systolic-30)*15/30, YELLOW);
			LCD_Fill(BP_REC_DATA_X+BP_REC_DATA_OFFSET_X*p_bpt->hour, BP_REC_DATA_Y-(p_bpt->bpt.diastolic-30)*15/30, BP_REC_DATA_W, (p_bpt->bpt.diastolic-30)*15/30, RED);
		}

		p_bpt++;
	}

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);
  #else		
	LCD_SetFontSize(FONT_SIZE_24);
  #endif
	strcpy(tmpbuf, "0/0");
	LCD_MeasureString(tmpbuf,&w,&h);
	LCD_ShowString(BP_NUM_X+(BP_NUM_W-w)/2, BP_NUM_Y+(BP_NUM_H-h)/2, tmpbuf);
	
  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
  #else
	LCD_SetFontSize(FONT_SIZE_16);
  #endif
	sprintf(tmpbuf, "%d/%d", last_health.bpt_max.systolic, last_health.bpt_max.diastolic);
	LCD_MeasureString(tmpbuf,&w,&h);
	LCD_ShowString(BP_UP_NUM_X+(BP_UP_NUM_W-w)/2, BP_UP_NUM_Y+(BP_UP_NUM_H-h)/2, tmpbuf);

	sprintf(tmpbuf, "%d/%d", last_health.bpt_min.systolic, last_health.bpt_min.diastolic);
	LCD_MeasureString(tmpbuf,&w,&h);
	LCD_ShowString(BP_DOWN_NUM_X+(BP_DOWN_NUM_W-w)/2, BP_DOWN_NUM_Y+(BP_DOWN_NUM_H-h)/2, tmpbuf);

