duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
		k_timer_start(&ppg_status_timer, K_SECONDS(5), K_NO_WAIT);
		break;
	}
#endif/*UI_STYLE_HEALTH_BAR*/
}

void HRShowStatus(void)
{
	uint8_t tmpbuf[128] = {0};
	hr_rec2_nod *p_hr;
	uint8_t hr_max=0,hr_min=0;
	uint16_t i,w,h;
	uint16_t title_str[LANGUAGE_MAX][20] = {
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0048,0x0065,0x0061,0x0072,0x0074,0x0020,0x0052,0x0061,0x0074,0x0065,0x0000},//Heart Rate
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												{0x0050,0x0075,0x006C,0x0073,0x0000},//Puls
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												{0x0046,0x0072,0x00E9,0x0071,0x0075,0x0065,0x006E,0x0063,0x0065,0x0020,0x0063,0x0061,0x0072,0x0064,0x0069,0x0061,0x0071,0x0075,0x0065,0x0000},//Fréquence cardiaque
											  #endif
											  #ifdef LANGUAGE_IT_ENABLE
												{0x0046,0x0072,0x0065,0x0071,0x0075,0x0065,0x006E,0x007A,0x0061,0x0020,0x0063,0x0061,0x0072,0x0064,0x0069,0x0061,0x0063,0x0061,0x0000},//Frequenza cardiaca
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												{0x0046,0x0072,0x0065,0x0063,0x0075,0x0065,0x006E,0x0063,0x0069,0x0061,0x0020,0x0063,0x0061,0x0072,0x0064,0x0069,0x0061,0x0063,0x0061,0x0000},//Frecuencia cardiaca
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												{0x0046,0x0072,0x0065,0x0071,0x0075,0x00EA,0x006E,0x0063,0x0069,0x0061,0x0020,0x0063,0x0061,0x0072,0x0064,0x00ED,0x0061,0x0063,0x0061,0x0000},//Frequência cardíaca
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												{0x0054,0x0119,0x0074,0x006E,0x006F,0x0000},//T?tno
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												{0x0048,0x006A,0x00E4,0x0072,0x0074,0x0066,0x0072,0x0065,0x006B,0x0076,0x0065,0x006E,0x0073,0x0000},//Hj?rtfrekvens
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												{0x5FC3,0x62CD,0x6570,0x0000},//心拍数
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												{0xC2EC,0xBC15,0xC218,0x0000},//???
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												{0x041F,0x0443,0x043B,0x044C,0x0441,0x0000},//пульс
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												{0x0636,0x0631,0x0628,0x0627,0x062A,0x0020,0x0627,0x0644,0x0642,0x0644,0x0628,0x0000},//????? ?????
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												{0x5FC3,0x7387,0x0000},//心率
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0048,0x0065,0x0061,0x0072,0x0074,0x0020,0x0052,0x0061,0x0074,0x0065,0x0000},//Heart Rate
											  #endif
											#endif
							 				};

#ifdef UI_STYLE_HEALTH_BAR
	LCD_ShowImg_From_Flash(HR_ICON_X, HR_ICON_Y, IMG_HR_ICON_ANI_2_ADDR);
	LCD_ShowImg_From_Flash(HR_UNIT_X, HR_UNIT_Y, IMG_HR_BPM_ADDR);
	LCD_ShowImg_From_Flash(HR_BG_X, HR_BG_Y, IMG_HR_BG_ADDR);
	LCD_ShowImg_From_Flash(HR_UP_ARRAW_X, HR_UP_ARRAW_Y, IMG_HR_UP_ARRAW_ADDR);
	LCD_ShowImg_From_Flash(HR_DOWN_ARRAW_X, HR_DOWN_ARRAW_Y, IMG_HR_DOWN_ARRAW_ADDR);
	
	memset(&ppgdata, 0x00, sizeof(ppgdata));
	GetCurDayHrRecData(&ppgdata);
	p_hr = (hr_rec2_nod*)&ppgdata;
	for(i=0;i<PPG_REC2_MAX_DAILY;i++)
	{
		if(p_hr->year == 0x0000
			|| p_hr->month == 0x00
			|| p_hr->day == 0x00
			)
		{
			break;
		}
		
		if((p_hr->hr >= PPG_HR_MIN) && (p_hr->hr <= PPG_HR_MAX))
		{
			LCD_Fill(HR_REC_DATA_X+HR_REC_DATA_OFFSET_X*p_hr->hour, HR_REC_DATA_Y-p_hr->hr*20/50, HR_REC_DATA_W, p_hr->hr*20/50, RED);
		}

		p_hr++;
	}

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_36);
  #else	
	LCD_SetFontSize(FONT_SIZE_32);
  #endif
	strcpy(tmpbuf, "0");
	LCD_MeasureString(tmpbuf,&w,&h);
	LCD_ShowString(HR_NUM_X+(HR_NUM_W-w)/2, HR_NUM_Y+(HR_NUM_H-h)/2, tmpbuf);

	sprintf(tmpbuf, "%d", last_health.hr_max);
	LCD_MeasureString(tmpbuf,&w,&h);
	LCD_ShowString(HR_UP_NUM_X+(HR_UP_NUM_W-w)/2, HR_UP_NUM_Y+(HR_UP_NUM_H-h)/2, tmpbuf);

	sprintf(tmpbuf, "%d", last_health.hr_min);
	LCD_MeasureString(tmpbuf,&w,&h);
	LCD_ShowString(HR_DOWN_NUM_X+(HR_DOWN_NUM_W-w)/2, HR_DOWN_NUM_Y+(HR_DOWN_NUM_H-h)/2, tmpbuf);
	
#else/*UI_STYLE_HEALTH_BAR*/

	uint8_t count=1;
	uint32_t divisor=10;
	uint32_t img_num[10] = {IMG_FONT_24_NUM_0_ADDR,IMG_FONT_24_NUM_1_ADDR,IMG_FONT_24_NUM_2_ADDR,IMG_FONT_24_NUM_3_ADDR,IMG_FONT_24_NUM_4_ADDR,
							IMG_FONT_24_NUM_5_ADDR,IMG_FONT_24_NUM_6_ADDR,IMG_FONT_24_NUM_7_ADDR,IMG_FONT_24_NUM_8_ADDR,IMG_FONT_24_NUM_9_ADDR};

	LCD_ShowImg_From_Flash(HR_ICON_X, HR_ICON_Y, IMG_HR_BIG_ICON_1_ADDR);
	LCD_ShowImg_From_Flash(HR_UP_ARRAW_X, HR_UP_ARRAW_Y, IMG_HR_UP_ARRAW_ADDR);
	LCD_ShowImg_From_Flash(HR_DOWN_ARRAW_X, HR_DOWN_ARRAW_Y, IMG_HR_DOWN_ARRAW_ADDR);

  #ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_28);
  #else	
	LCD_SetFontSize(FONT_SIZE_24);
  #endif

	switch(global_settings.language)
	{
   #ifdef LANGUAGE_RU_ENABLE      
	case LANGUAGE_RU:
		mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)title_str[global_settings.language], MENU_NOTIFY_STR_MAX-14);
		break;
   #endif
  
	default:
		mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)title_str[global_settings.language], MENU_NOTIFY_STR_MAX-8);
		break;
	}
	
	LCD_MeasureUniString(tmpbuf,&w,&h);
#ifdef LANGUAGE_AR_ENABLE	
	if(g_language_r2l)
		LCD_ShowUniStringRtoL(HR_NOTIFY_X+(HR_NOTIFY_W+w)/2, HR_NOTIFY_Y, tmpbuf);
	else
#endif		
		LCD_ShowUniString(HR_NOTIFY_X+(HR_NOTIFY_W-w)/2, HR_NOTIFY_Y, tmpbuf);

	PPGShowNumByImg(HR_UP_STR_X, HR_UP_STR_Y, HR_UP_STR_W, HR_UP_STR_H, HR_UP_NUM_W, img_num, last_health.hr_max);
	PPGShowNumByImg(HR_DOWN_STR_X, HR_DOWN_STR_Y, HR_DOWN_STR_W, HR_DOWN_STR_H, HR_UP_NUM_W, img_num, last_health.hr_min);

	k_timer_start(&ppg_status_timer, K_SECONDS(2), K_NO_WAIT);
#endif/*UI_STYLE_HEALTH_BAR*/
}

void HRScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_HR].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_HR].status = SCREEN_STATUS_CREATED;

		LCD_Clear(BLACK);
	#ifndef UI_STYLE_HEALTH_BAR	
		IdleShowSignal();
		IdleShowNetMode();
		IdleShowBatSoc();
	#endif
		HRShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
	#ifndef UI_STYLE_HEALTH_BAR
		if(scr_msg[SCREEN_ID_HR].para&SCREEN_EVENT_UPDATE_SIG)
		{
			scr_msg[SCREEN_ID_HR].para &= (~SCREEN_EVENT_UPDATE_SIG);
			IdleShowSignal();
		}
		if(scr_msg[SCREEN_ID_HR].para&SCREEN_EVENT_UPDATE_NET_MODE)
		{
			scr_msg[SCREEN_ID_HR].para &= (~SCREEN_EVENT_UPDATE_NET_MODE);	
			IdleShowNetMode();
		}
		if(scr_msg[SCREEN_ID_HR].para&SCREEN_EVENT_UPDATE_BAT)
		{
			scr_msg[SCREEN_ID_HR].para &= (~SCREEN_EVENT_UPDATE_BAT);
			IdleUpdateBatSoc();
		}
	#endif
		if(scr_msg[SCREEN_ID_HR].para&SCREEN_EVENT_UPDATE_HR)
		{
			scr_msg[SCREEN_ID_HR].para &= (~SCREEN_EVENT_UPDATE_HR);
			HRUpdateStatus();
		}
		break;
	}
	
	scr_msg[SCREEN_ID_HR].act = SCREEN_ACTION_NO;
}

void ExitHRScreen(void)
{
	k_timer_stop(&mainmenu_timer);
#ifndef UI_STYLE_HEALTH_BAR	
	k_timer_stop(&ppg_status_timer);
#endif
	img_index = 0;
	
#ifdef CONFIG_ANIMATION_SUPPORT
	AnimaStop();
#endif

