duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	case NOTIFY_ALIGN_BOUNDARY:
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStringRtoLInRect(notify_msg.x+notify_msg.w-offset_w, notify_msg.y+offset_h, (notify_msg.w-2*offset_w), (notify_msg.h-2*offset_h), notify_msg.text);
		else
	#endif		
			LCD_ShowUniStringInRect(notify_msg.x+offset_w, notify_msg.y+offset_h, (notify_msg.w-2*offset_w), (notify_msg.h-2*offset_h), notify_msg.text);
		break;
	}
}

void NotifyScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_NOTIFY].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_NOTIFY].status = SCREEN_STATUS_CREATED;
				
		NotifyShow();
		break;
		
	case SCREEN_ACTION_UPDATE:
		NotifyUpdate();
		break;

	case SCREEN_ACTION_EXIT:
		ExitNotifyScreen();
		break;
	}
	
	scr_msg[SCREEN_ID_NOTIFY].act = SCREEN_ACTION_NO;
}

#if defined(CONFIG_DATA_DOWNLOAD_SUPPORT)||defined(CONFIG_FOTA_DOWNLOAD)
//linking
#ifdef LANGUAGE_CN_ENABLE
uint16_t str_linking_cn[] =
{
	//连接服务器...
	0x8FDE,0x63A5,0x670D,0x52A1,0x5668,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_EN_ENABLE
uint16_t str_linking_en[] =
{
	//Linking to the server ...
	0x004C,0x0069,0x006E,0x006B,0x0069,0x006E,0x0067,0x0020,0x0074,0x006F,0x0020,0x0074,0x0068,0x0065,0x0020,0x0073,
	0x0065,0x0072,0x0076,0x0065,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_DE_ENABLE
uint16_t str_linking_de[] =
{
	//Verlinkung zum Server ...
	0x0056,0x0065,0x0072,0x006C,0x0069,0x006E,0x006B,0x0075,0x006E,0x0067,0x0020,0x007A,0x0075,0x006D,0x0020,0x0053,
	0x0065,0x0072,0x0076,0x0065,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_FR_ENABLE
uint16_t str_linking_fr[] =
{
	//Connexion au serveur en cours ...
	0x0043,0x006F,0x006E,0x006E,0x0065,0x0078,0x0069,0x006F,0x006E,0x0020,0x0061,0x0075,0x0020,0x0073,0x0065,0x0072,
	0x0076,0x0065,0x0075,0x0072,0x0020,0x0065,0x006E,0x0020,0x0063,0x006F,0x0075,0x0072,0x0073,0x0020,0x002E,0x002E,
	0x002E,0x0000
};
#endif
#ifdef LANGUAGE_IT_ENABLE
uint16_t str_linking_it[] =
{
	//Connessione al server ...
	0x0043,0x006F,0x006E,0x006E,0x0065,0x0073,0x0073,0x0069,0x006F,0x006E,0x0065,0x0020,0x0061,0x006C,0x0020,0x0073,
	0x0065,0x0072,0x0076,0x0065,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_ES_ENABLE
uint16_t str_linking_es[] =
{
	//Enlace al servidor ...
	0x0045,0x006E,0x006C,0x0061,0x0063,0x0065,0x0020,0x0061,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,0x0069,0x0064,
	0x006F,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_PT_ENABLE
uint16_t str_linking_pt[] =
{
	//Vinculando ao servidor ...
	0x0056,0x0069,0x006E,0x0063,0x0075,0x006C,0x0061,0x006E,0x0064,0x006F,0x0020,0x0061,0x006F,0x0020,0x0073,0x0065,
	0x0072,0x0076,0x0069,0x0064,0x006F,0x0072,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_PL_ENABLE
uint16_t str_linking_pl[] =
{
	//??cz? z serwerem ...
	0x0141,0x0105,0x0063,0x007A,0x0119,0x0020,0x007A,0x0020,0x0073,0x0065,0x0072,0x0077,0x0065,0x0072,0x0065,0x006D,
	0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_SE_ENABLE
uint16_t str_linking_se[] =
{
	//L?nkar till servern ...
	0x004C,0x00E4,0x006E,0x006B,0x0061,0x0072,0x0020,0x0074,0x0069,0x006C,0x006C,0x0020,0x0073,0x0065,0x0072,0x0076,
	0x0065,0x0072,0x006E,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_JP_ENABLE
uint16_t str_linking_jp[] =
{
	//サーバーに接続中 ...
	0x30B5,0x30FC,0x30D0,0x30FC,0x306B,0x63A5,0x7D9A,0x4E2D,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_KR_ENABLE
uint16_t str_linking_kr[] =
{
	//??? ?? ? ...
	0xC11C,0xBC84,0xC5D0,0x0020,0xC5F0,0xACB0,0x0020,0xC911,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_RU_ENABLE
uint16_t str_linking_ru[] =
{
	//Подключение к серверу ...
	0x041F,0x043E,0x0434,0x043A,0x043B,0x044E,0x0447,0x0435,0x043D,0x0438,0x0435,0x0020,0x043A,0x0020,0x0441,0x0435,
	0x0440,0x0432,0x0435,0x0440,0x0443,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_AR_ENABLE
uint16_t str_linking_ar[] =
{
	//??? ??????? ...
	0x0631,0x0628,0x0637,0x0020,0x0628,0x0627,0x0644,0x062E,0x0627,0x062F,0x0645,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif

//Downloading
#ifdef LANGUAGE_CN_ENABLE
uint16_t str_downloading_cn[] =
{
	//数据下载中…
	0x6570,0x636E,0x4E0B,0x8F7D,0x4E2D,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_EN_ENABLE
uint16_t str_downloading_en[] =
{
	//Downloading data ...
	0x0044,0x006F,0x0077,0x006E,0x006C,0x006F,0x0061,0x0064,0x0069,0x006E,0x0067,0x0020,0x0064,0x0061,0x0074,0x0061,
	0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_DE_ENABLE
uint16_t str_downloading_de[] =
{
	//Daten werden heruntergeladen ...
	0x0044,0x0061,0x0074,0x0065,0x006E,0x0020,0x0077,0x0065,0x0072,0x0064,0x0065,0x006E,0x0020,0x0068,0x0065,0x0072,
	0x0075,0x006E,0x0074,0x0065,0x0072,0x0067,0x0065,0x006C,0x0061,0x0064,0x0065,0x006E,0x0020,0x002E,0x002E,0x002E,
	0x0000
};
#endif
#ifdef LANGUAGE_FR_ENABLE
uint16_t str_downloading_fr[] =
{
	//Téléchargement des données ...
	0x0054,0x00E9,0x006C,0x00E9,0x0063,0x0068,0x0061,0x0072,0x0067,0x0065,0x006D,0x0065,0x006E,0x0074,0x0020,0x0064,
	0x0065,0x0073,0x0020,0x0064,0x006F,0x006E,0x006E,0x00E9,0x0065,0x0073,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_IT_ENABLE
uint16_t str_downloading_it[] =
{
	//Scaricare i dati ...
	0x0053,0x0063,0x0061,0x0072,0x0069,0x0063,0x0061,0x0072,0x0065,0x0020,0x0069,0x0020,0x0064,0x0061,0x0074,0x0069,
	0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_ES_ENABLE
uint16_t str_downloading_es[] =
{
	//Descarga de datos ...
	0x0044,0x0065,0x0073,0x0063,0x0061,0x0072,0x0067,0x0061,0x0020,0x0064,0x0065,0x0020,0x0064,0x0061,0x0074,0x006F,
	0x0073,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_PT_ENABLE
uint16_t str_downloading_pt[] =
{
	//Baixando dados ...
	0x0042,0x0061,0x0069,0x0078,0x0061,0x006E,0x0064,0x006F,0x0020,0x0064,0x0061,0x0064,0x006F,0x0073,0x0020,0x002E,
	0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_PL_ENABLE
uint16_t str_downloading_pl[] =
{
	//Pobieranie danych ...
	0x0050,0x006F,0x0062,0x0069,0x0065,0x0072,0x0061,0x006E,0x0069,0x0065,0x0020,0x0064,0x0061,0x006E,0x0079,0x0063,
	0x0068,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_SE_ENABLE
uint16_t str_downloading_se[] =
{
	//Data h?mtas ...
	0x0044,0x0061,0x0074,0x0061,0x0020,0x0068,0x00E4,0x006D,0x0074,0x0061,0x0073,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_JP_ENABLE
uint16_t str_downloading_jp[] =
{
	//データをダウンロード中 ...
	0x30C7,0x30FC,0x30BF,0x3092,0x30C0,0x30A6,0x30F3,0x30ED,0x30FC,0x30C9,0x4E2D,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_KR_ENABLE
uint16_t str_downloading_kr[] =
{
	//??? ???? ? ...
	0xB370,0xC774,0xD130,0x0020,0xB2E4,0xC6B4,0xB85C,0xB4DC,0x0020,0xC911,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_RU_ENABLE
uint16_t str_downloading_ru[] =
{
	//Загрузка данных ...
	0x0417,0x0430,0x0433,0x0440,0x0443,0x0437,0x043A,0x0430,0x0020,0x0434,0x0430,0x043D,0x043D,0x044B,0x0445,0x0020,
	0x002E,0x002E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_AR_ENABLE
uint16_t str_downloading_ar[] =
{
	//???? ????? ???????? ...
	0x062C,0x0627,0x0631,0x064D,0x0020,0x062A,0x0646,0x0632,0x064A,0x0644,0x0020,0x0627,0x0644,0x0628,0x064A,0x0627,
	0x0646,0x0627,0x062A,0x0020,0x002E,0x002E,0x002E,0x0000
};
#endif

//Finish
#ifdef LANGUAGE_CN_ENABLE
uint16_t str_finish_cn[] =
{
	//升级成功
	0x5347,0x7EA7,0x6210,0x529F,0x0000
};
#endif
#ifdef LANGUAGE_EN_ENABLE
uint16_t str_finish_en[] =
{
	//Upgrade Successful
	0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0053,0x0075,0x0063,0x0063,0x0065,0x0073,0x0073,0x0066,
	0x0075,0x006C,0x0000
};
#endif
#ifdef LANGUAGE_DE_ENABLE
uint16_t str_finish_de[] =
{
	//Upgrade erfolgreich
	0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0065,0x0072,0x0066,0x006F,0x006C,0x0067,0x0072,0x0065,
	0x0069,0x0063,0x0068,0x0000
};
#endif
#ifdef LANGUAGE_FR_ENABLE
uint16_t str_finish_fr[] =
{
	//Mise à jour réussie
	0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0020,0x0072,0x00E9,0x0075,0x0073,
	0x0073,0x0069,0x0065,0x0000
};
#endif
#ifdef LANGUAGE_IT_ENABLE
uint16_t str_finish_it[] =
{
	//Aggiornamento riuscito
	0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0072,0x0069,
	0x0075,0x0073,0x0063,0x0069,0x0074,0x006F,0x0000
};
#endif
#ifdef LANGUAGE_ES_ENABLE
uint16_t str_finish_es[] =
{
	//Actualización exitosa
	0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0065,0x0078,
	0x0069,0x0074,0x006F,0x0073,0x0061,0x0000
};
#endif
#ifdef LANGUAGE_PT_ENABLE
uint16_t str_finish_pt[] =
{
	//Atualiza??o bem-sucedida
	0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0062,0x0065,0x006D,0x2013,
	0x0073,0x0075,0x0063,0x0065,0x0064,0x0069,0x0064,0x0061,0x0000
};
#endif
#ifdef LANGUAGE_PL_ENABLE
uint16_t str_finish_pl[] =
{
	//Aktual. zakończona
	0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x002E,0x0020,0x007A,0x0061,0x006B,0x006F,0x0144,0x0063,0x007A,0x006F,
	0x006E,0x0061,0x0000
};
#endif
#ifdef LANGUAGE_SE_ENABLE
uint16_t str_finish_se[] =
{
	//Uppgradering slutf?rd!
	0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0020,0x0073,0x006C,0x0075,
	0x0074,0x0066,0x00F6,0x0072,0x0064,0x0021,0x0000
};
#endif
#ifdef LANGUAGE_JP_ENABLE
uint16_t str_finish_jp[] =
{
	//アップグレード成功
	0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x6210,0x529F,0x0000
};
#endif
#ifdef LANGUAGE_KR_ENABLE
uint16_t str_finish_kr[] =
{
	//????? ??
	0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0020,0xC131,0xACF5,0x0000
};
#endif
#ifdef LANGUAGE_RU_ENABLE
uint16_t str_finish_ru[] =
{
	//Обновление завершено
	0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0437,0x0430,0x0432,0x0435,0x0440,
	0x0448,0x0435,0x043D,0x043E,0x0000
};
#endif
#ifdef LANGUAGE_AR_ENABLE
uint16_t str_finish_ar[] =
{
	//?????? ???????
	0x0627,0x0643,0x062A,0x0645,0x0644,0x062A,0x0020,0x0627,0x0644,0x062A,0x0631,0x0642,0x064A,0x0629,0x0000
};
#endif

//Fail
#ifdef LANGUAGE_CN_ENABLE
uint16_t str_fail_cn[] =
{
	//升级失败
	0x5347,0x7EA7,0x5931,0x8D25,0x0000
};
#endif
#ifdef LANGUAGE_EN_ENABLE
uint16_t str_fail_en[] =
{
	//Upgrade failed
	0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0061,0x0069,0x006C,0x0065,0x0064,0x0000
};
#endif
#ifdef LANGUAGE_DE_ENABLE
uint16_t str_fail_de[] =
{
	//Upgrade fehlgeschlagen
	0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0066,0x0065,0x0068,0x006C,0x0067,0x0065,0x0073,0x0063,
	0x0068,0x006C,0x0061,0x0067,0x0065,0x006E,0x0000
};
#endif
#ifdef LANGUAGE_FR_ENABLE
uint16_t str_fail_fr[] =
{
	//échec de la mise à jour
	0x00C9,0x0063,0x0068,0x0065,0x0063,0x0020,0x0064,0x0065,0x0020,0x006C,0x0061,0x0020,0x006D,0x0069,0x0073,0x0065,
	0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0000
};
#endif
#ifdef LANGUAGE_IT_ENABLE
uint16_t str_fail_it[] =
{
	//Aggiornamento fallito
	0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0066,0x0061,
	0x006C,0x006C,0x0069,0x0074,0x006F,0x0000
};
#endif
#ifdef LANGUAGE_ES_ENABLE
uint16_t str_fail_es[] =
{
	//Error de actualización
	0x0045,0x0072,0x0072,0x006F,0x0072,0x0020,0x0064,0x0065,0x0020,0x0061,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,
	0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0000
};
#endif
#ifdef LANGUAGE_PT_ENABLE
uint16_t str_fail_pt[] =
{
	//Falha na atualiza??o
	0x0046,0x0061,0x006C,0x0068,0x0061,0x0020,0x006E,0x0061,0x0020,0x0061,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,
	0x0061,0x00E7,0x00E3,0x006F,0x0000
};
#endif
#ifdef LANGUAGE_PL_ENABLE
uint16_t str_fail_pl[] =
{
	//Aktual. nieudana
	0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x002E,0x0020,0x006E,0x0069,0x0065,0x0075,0x0064,0x0061,0x006E,0x0061,
	0x0000
};
#endif
#ifdef LANGUAGE_SE_ENABLE
uint16_t str_fail_se[] =
{
	//Uppgradering misslyckades！
	0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0020,0x006D,0x0069,0x0073,
	0x0073,0x006C,0x0079,0x0063,0x006B,0x0061,0x0064,0x0065,0x0073,0xFF01,0x0000
};
#endif
#ifdef LANGUAGE_JP_ENABLE
uint16_t str_fail_jp[] =
{
	//アップグレード失敗
	0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x5931,0x6557,0x0000
};
#endif
#ifdef LANGUAGE_KR_ENABLE
uint16_t str_fail_kr[] =
{
	//????? ??
	0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0020,0xC2E4,0xD328,0x0000
};
#endif
#ifdef LANGUAGE_RU_ENABLE
uint16_t str_fail_ru[] =
{
	//Обновление не удалось.
	0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x043D,0x0435,0x0020,0x0443,0x0434,
	0x0430,0x043B,0x043E,0x0441,0x044C,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_AR_ENABLE
uint16_t str_fail_ar[] =
{
	//???? ???????
	0x0641,0x0634,0x0644,0x062A,0x0020,0x0627,0x0644,0x062A,0x0631,0x0642,0x064A,0x06290,0x0000
};
#endif

#endif/*CONFIG_DATA_DOWNLOAD_SUPPORT || CONFIG_FOTA_DOWNLOAD*/


#ifdef CONFIG_DATA_DOWNLOAD_SUPPORT
#ifdef LANGUAGE_CN_ENABLE
uint16_t dl_idle_notify_cn[] = 
{
	//确保电量大于80%或者充电器已经连接。
	0x786E,0x4FDD,0x7535,0x91CF,0x5927,0x4E8E,0x0038,0x0030,0x0025,0x6216,0x8005,0x5145,0x7535,0x5668,0x5DF2,0x7ECF,
	0x8FDE,0x63A5,0x3002,0x0000
};
#endif
#ifdef LANGUAGE_EN_ENABLE
uint16_t dl_idle_notify_en[] = 
{
	//Ensure the battery level is over 80% or the charger is connected.
	0x0045,0x006E,0x0073,0x0075,0x0072,0x0065,0x0020,0x0074,0x0068,0x0065,0x0020,0x0062,0x0061,0x0074,0x0074,0x0065,
	0x0072,0x0079,0x0020,0x006C,0x0065,0x0076,0x0065,0x006C,0x0020,0x0069,0x0073,0x0020,0x006F,0x0076,0x0065,0x0072,
	0x0020,0x0038,0x0030,0x0025,0x0020,0x006F,0x0072,0x0020,0x0074,0x0068,0x0065,0x0020,0x0063,0x0068,0x0061,0x0072,
	0x0067,0x0065,0x0072,0x0020,0x0069,0x0073,0x0020,0x0063,0x006F,0x006E,0x006E,0x0065,0x0063,0x0074,0x0065,0x0064,
	0x002E,0x0000
};
#endif
#ifdef LANGUAGE_DE_ENABLE
uint16_t dl_idle_notify_de[] = 
{
	//Stellen Sie sicher, dass der Akkustand über 80 % liegt oder das Ladekabel angeschlossen ist.
	0x0053,0x0074,0x0065,0x006C,0x006C,0x0065,0x006E,0x0020,0x0053,0x0069,0x0065,0x0020,0x0073,0x0069,0x0063,0x0068,
	0x0065,0x0072,0x002C,0x0020,0x0064,0x0061,0x0073,0x0073,0x0020,0x0064,0x0065,0x0072,0x0020,0x0041,0x006B,0x006B,
	0x0075,0x0073,0x0074,0x0061,0x006E,0x0064,0x0020,0x00FC,0x0062,0x0065,0x0072,0x0020,0x0038,0x0030,0x0020,0x0025,
	0x0020,0x006C,0x0069,0x0065,0x0067,0x0074,0x0020,0x006F,0x0064,0x0065,0x0072,0x0020,0x0064,0x0061,0x0073,0x0020,
	0x004C,0x0061,0x0064,0x0065,0x006B,0x0061,0x0062,0x0065,0x006C,0x0020,0x0061,0x006E,0x0067,0x0065,0x0073,0x0063,
	0x0068,0x006C,0x006F,0x0073,0x0073,0x0065,0x006E,0x0020,0x0069,0x0073,0x0074,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_FR_ENABLE
uint16_t dl_idle_notify_fr[] =
{
	//Assurez-vous que le niveau de batterie est supérieur à 80 % ou que le c?ble de chargement est connecté.
	0x0041,0x0073,0x0073,0x0075,0x0072,0x0065,0x007A,0x2013,0x0076,0x006F,0x0075,0x0073,0x0020,0x0071,0x0075,0x0065,
	0x0020,0x006C,0x0065,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0064,0x0065,0x0020,0x0062,0x0061,
	0x0074,0x0074,0x0065,0x0072,0x0069,0x0065,0x0020,0x0065,0x0073,0x0074,0x0020,0x0073,0x0075,0x0070,0x00E9,0x0072,
	0x0069,0x0065,0x0075,0x0072,0x0020,0x00E0,0x0020,0x0038,0x0030,0x0020,0x0025,0x0020,0x006F,0x0075,0x0020,0x0071,
	0x0075,0x0065,0x0020,0x006C,0x0065,0x0020,0x0063,0x00E2,0x0062,0x006C,0x0065,0x0020,0x0064,0x0065,0x0020,0x0063,
	0x0068,0x0061,0x0072,0x0067,0x0065,0x006D,0x0065,0x006E,0x0074,0x0020,0x0065,0x0073,0x0074,0x0020,0x0063,0x006F,
	0x006E,0x006E,0x0065,0x0063,0x0074,0x00E9,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_IT_ENABLE
uint16_t dl_idle_notify_it[] =
{
	//Assicurarsi che il livello della batteria sia superiore all'80% o che il cavo di ricarica sia collegato.
	0x0041,0x0073,0x0073,0x0069,0x0063,0x0075,0x0072,0x0061,0x0072,0x0073,0x0069,0x0020,0x0063,0x0068,0x0065,0x0020,
	0x0069,0x006C,0x0020,0x006C,0x0069,0x0076,0x0065,0x006C,0x006C,0x006F,0x0020,0x0064,0x0065,0x006C,0x006C,0x0061,
	0x0020,0x0062,0x0061,0x0074,0x0074,0x0065,0x0072,0x0069,0x0061,0x0020,0x0073,0x0069,0x0061,0x0020,0x0073,0x0075,
	0x0070,0x0065,0x0072,0x0069,0x006F,0x0072,0x0065,0x0061,0x006C,0x006C,0x0027,0x0038,0x0030,0x0025,0x0020,0x006F,
	0x0020,0x0063,0x0068,0x0065,0x0020,0x0069,0x006C,0x0020,0x0063,0x0061,0x0076,0x006F,0x0020,0x0064,0x0069,0x0020,
	0x0072,0x0069,0x0063,0x0061,0x0072,0x0069,0x0063,0x0061,0x0020,0x0073,0x0069,0x0061,0x0020,0x0063,0x006F,0x006C,
	0x006C,0x0065,0x0067,0x0061,0x0074,0x006F,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_ES_ENABLE
uint16_t dl_idle_notify_es[] =
{
	//Asegúrate de que el nivel de la batería es superior al 80% o de que el cable de carga está conectado.
	0x0041,0x0073,0x0065,0x0067,0x00FA,0x0072,0x0061,0x0074,0x0065,0x0020,0x0064,0x0065,0x0020,0x0071,0x0075,0x0065,
	0x0020,0x0065,0x006C,0x0020,0x006E,0x0069,0x0076,0x0065,0x006C,0x0020,0x0064,0x0065,0x0020,0x006C,0x0061,0x0020,
	0x0062,0x0061,0x0074,0x0065,0x0072,0x00ED,0x0061,0x0020,0x0065,0x0073,0x0020,0x0073,0x0075,0x0070,0x0065,0x0072,
	0x0069,0x006F,0x0072,0x0020,0x0061,0x006C,0x0020,0x0038,0x0030,0x0025,0x0020,0x006F,0x0020,0x0064,0x0065,0x0020,
	0x0071,0x0075,0x0065,0x0020,0x0065,0x006C,0x0020,0x0063,0x0061,0x0062,0x006C,0x0065,0x0020,0x0064,0x0065,0x0020,
	0x0063,0x0061,0x0072,0x0067,0x0061,0x0020,0x0065,0x0073,0x0074,0x00E1,0x0020,0x0063,0x006F,0x006E,0x0065,0x0063,
	0x0074,0x0061,0x0064,0x006F,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_PT_ENABLE
uint16_t dl_idle_notify_pt[] =
{
	//Certifique-se de que o nível da bateria é superior a 80% ou que o cabo de carregamento está ligado.
	0x0043,0x0065,0x0072,0x0074,0x0069,0x0066,0x0069,0x0071,0x0075,0x0065,0x2013,0x0073,0x0065,0x0020,0x0064,0x0065,
	0x0020,0x0071,0x0075,0x0065,0x0020,0x006F,0x0020,0x006E,0x00ED,0x0076,0x0065,0x006C,0x0020,0x0064,0x0061,0x0020,
	0x0062,0x0061,0x0074,0x0065,0x0072,0x0069,0x0061,0x0020,0x00E9,0x0020,0x0073,0x0075,0x0070,0x0065,0x0072,0x0069,
	0x006F,0x0072,0x0061,0x0038,0x0030,0x0025,0x0020,0x006F,0x0075,0x0020,0x0071,0x0075,0x0065,0x0020,0x006F,0x0020,
	0x0063,0x0061,0x0062,0x006F,0x0020,0x0064,0x0065,0x0020,0x0063,0x0061,0x0072,0x0072,0x0065,0x0067,0x0061,0x006D,
	0x0065,0x006E,0x0074,0x006F,0x0020,0x0065,0x0073,0x0074,0x00E1,0x0020,0x006C,0x0069,0x0067,0x0061,0x0064,0x006F,
	0x002E,0x0000
};
#endif
#ifdef LANGUAGE_PL_ENABLE
uint16_t dl_idle_notify_pl[] =
{
	//Sprawd?, czy poziom na?adowania baterii wynosi ponad 80% lub czy ?adowarka jest pod??czona.
	0x0053,0x0070,0x0072,0x0061,0x0077,0x0064,0x017A,0x002C,0x0020,0x0063,0x007A,0x0079,0x0020,0x0070,0x006F,0x007A,
	0x0069,0x006F,0x006D,0x0020,0x006E,0x0061,0x0142,0x0061,0x0064,0x006F,0x0077,0x0061,0x006E,0x0069,0x0061,0x0020,
	0x0062,0x0061,0x0074,0x0065,0x0072,0x0069,0x0069,0x0020,0x0077,0x0079,0x006E,0x006F,0x0073,0x0069,0x0020,0x0070,
	0x006F,0x006E,0x0061,0x0064,0x0020,0x0038,0x0030,0x0025,0x0020,0x006C,0x0075,0x0062,0x0020,0x0063,0x007A,0x0079,
	0x0020,0x0142,0x0061,0x0064,0x006F,0x0077,0x0061,0x0072,0x006B,0x0061,0x0020,0x006A,0x0065,0x0073,0x0074,0x0020,
	0x0070,0x006F,0x0064,0x0142,0x0105,0x0063,0x007A,0x006F,0x006E,0x0061,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_SE_ENABLE
uint16_t dl_idle_notify_se[] =
{
	//V?nligen s?kerst?ll att batteriniv?n ?r ?ver 80% eller att laddaren ?r ansluten.
	0x0056,0x00E4,0x006E,0x006C,0x0069,0x0067,0x0065,0x006E,0x0020,0x0073,0x00E4,0x006B,0x0065,0x0072,0x0073,0x0074,
	0x00E4,0x006C,0x006C,0x0020,0x0061,0x0074,0x0074,0x0020,0x0062,0x0061,0x0074,0x0074,0x0065,0x0072,0x0069,0x006E,
	0x0069,0x0076,0x00E5,0x006E,0x0020,0x00E4,0x0072,0x0020,0x00F6,0x0076,0x0065,0x0072,0x0020,0x0038,0x0030,0x0025,
	0x0020,0x0065,0x006C,0x006C,0x0065,0x0072,0x0020,0x0061,0x0074,0x0074,0x0020,0x006C,0x0061,0x0064,0x0064,0x0061,
	0x0072,0x0065,0x006E,0x00E4,0x0072,0x0020,0x0061,0x006E,0x0073,0x006C,0x0075,0x0074,0x0065,0x006E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_JP_ENABLE
uint16_t dl_idle_notify_jp[] =
{
	//バッテリーが80%以上、または充電器が接続中であることを確認してください。
	0x30D0,0x30C3,0x30C6,0x30EA,0x30FC,0x304C,0x0038,0x0030,0x0025,0x4EE5,0x4E0A,0x3001,0x307E,0x305F,0x306F,0x5145,
	0x96FB,0x5668,0x304C,0x63A5,0x7D9A,0x4E2D,0x3067,0x3042,0x308B,0x3053,0x3068,0x3092,0x78BA,0x8A8D,0x3057,0x3066,
	0x304F,0x3060,0x3055,0x3044,0x3002,0x0000
};
#endif
#ifdef LANGUAGE_KR_ENABLE
uint16_t dl_idle_notify_kr[] =
{
	//???? 80% ?? ?????? ???? ???? ??? ?????.
	0xBC30,0xD130,0xB9AC,0xAC00,0x0020,0x0038,0x0030,0x0025,0x0020,0xC774,0xC0C1,0x0020,0xCDA9,0xC804,0xB418,0xC5C8,
	0xAC70,0xB098,0x0020,0xCDA9,0xC804,0xAE30,0xAC00,0x0020,0xC5F0,0xACB0,0xB418,0xC5B4,0x0020,0xC788,0xB294,0xC9C0,
	0x0020,0xD655,0xC778,0xD558,0xC138,0xC694,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_RU_ENABLE
uint16_t dl_idle_notify_ru[] =
{
	//Убедитесь, что заряд батареи выше 80% или зарядное устройство подключено.
	0x0423,0x0431,0x0435,0x0434,0x0438,0x0442,0x0435,0x0441,0x044C,0x002C,0x0020,0x0447,0x0442,0x043E,0x0020,0x0437,
	0x0430,0x0440,0x044F,0x0434,0x0020,0x0431,0x0430,0x0442,0x0430,0x0440,0x0435,0x0438,0x0020,0x0432,0x044B,0x0448,
	0x0435,0x0020,0x0038,0x0030,0x0025,0x0020,0x0438,0x043B,0x0438,0x0020,0x0437,0x0430,0x0440,0x044F,0x0434,0x043D,
	0x043E,0x0435,0x0020,0x0443,0x0441,0x0442,0x0440,0x043E,0x0439,0x0441,0x0442,0x0432,0x043E,0x0020,0x043F,0x043E,
	0x0434,0x043A,0x043B,0x044E,0x0447,0x0435,0x043D,0x043E,0x002E,0x0000
};
#endif
#ifdef LANGUAGE_AR_ENABLE
uint16_t dl_idle_notify_ar[] =
{
	//???? ?? ?? ????? ???????? ???? ?? 80%  ?? ?? ?????? ????.
	0x062A,0x0623,0x0643,0x062F,0x0020,0x0645,0x0646,0x0020,0x0623,0x0646,0x0020,0x0645,0x0633,0x062A,0x0648,0x0649,
	0x0020,0x0627,0x0644,0x0628,0x0637,0x0627,0x0631,0x064A,0x0629,0x0020,0x064A,0x0632,0x064A,0x062F,0x0020,0x0639,
	0x0646,0x0038,0x0030,0x0025,0x0623,0x0648,0x0020,0x0623,0x0646,0x0020,0x0627,0x0644,0x0634,0x0627,0x062D,0x0646,
	0x0020,0x0645,0x062A,0x0635,0x0644,0x002E,0x0000
};
#endif

