duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
void DlShowStatus(void)
{
	uint16_t x,y,w,h;
	uint8_t str_title[128] = {0};
	uint16_t *str_notify[LANGUAGE_MAX] = {
										#ifndef FW_FOR_CN
										  #ifdef LANGUAGE_EN_ENABLE
											dl_idle_notify_en,
										  #endif
										  #ifdef LANGUAGE_DE_ENABLE
											dl_idle_notify_de,
										  #endif
										  #ifdef LANGUAGE_FR_ENABLE
											dl_idle_notify_fr,
										  #endif
										  #ifdef LANGUAGE_IT_ENABLE
											dl_idle_notify_it,
										  #endif
										  #ifdef LANGUAGE_ES_ENABLE
											dl_idle_notify_es,
										  #endif
										  #ifdef LANGUAGE_PT_ENABLE
											dl_idle_notify_pt,
										  #endif
										  #ifdef LANGUAGE_PL_ENABLE
											dl_idle_notify_pl,
										  #endif
										  #ifdef LANGUAGE_SE_ENABLE
											dl_idle_notify_se,
										  #endif
										  #ifdef LANGUAGE_JP_ENABLE
											dl_idle_notify_jp,
										  #endif
										  #ifdef LANGUAGE_KR_ENABLE
											dl_idle_notify_kr,
										  #endif
										  #ifdef LANGUAGE_RU_ENABLE
											dl_idle_notify_ru,
										  #endif
										  #ifdef LANGUAGE_AR_ENABLE
											dl_idle_notify_ar,
										  #endif
										#else
										  #ifdef LANGUAGE_CN_ENABLE
											dl_idle_notify_cn,
										  #endif
										  #ifdef LANGUAGE_EN_ENABLE
											dl_idle_notify_en,
										  #endif
										#endif
										};
	uint16_t str_ui_title[LANGUAGE_MAX][41] = {
										#ifndef FW_FOR_CN
										  #ifdef LANGUAGE_EN_ENABLE
											{
												//UI Upgrade
												0x0055,0x0049,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_DE_ENABLE
											{
												//UI-Upgrade
												0x0055,0x0049,0x2013,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_FR_ENABLE
											{
												//Mise à niveau de l'interface utilisateur
												0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0064,0x0065,
												0x0020,0x006C,0x0027,0x0069,0x006E,0x0074,0x0065,0x0072,0x0066,0x0061,0x0063,0x0065,0x0020,0x0075,0x0074,0x0069,
												0x006C,0x0069,0x0073,0x0061,0x0074,0x0065,0x0075,0x0072,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_IT_ENABLE
											{
												//Aggiornamento dell'interfaccia utente
												0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,
												0x006C,0x006C,0x0027,0x0069,0x006E,0x0074,0x0065,0x0072,0x0066,0x0061,0x0063,0x0063,0x0069,0x0061,0x0020,0x0075,
												0x0074,0x0065,0x006E,0x0074,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_ES_ENABLE
											{
												//Actualización de la interfaz de usuario
												0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,
												0x0020,0x006C,0x0061,0x0020,0x0069,0x006E,0x0074,0x0065,0x0072,0x0066,0x0061,0x007A,0x0020,0x0064,0x0065,0x0020,
												0x0075,0x0073,0x0075,0x0061,0x0072,0x0069,0x006F,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_PT_ENABLE
											{
												//Atualiza??o da IU
												0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x0061,0x0020,0x0049,
												0x0055,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_PL_ENABLE
											{
												//Aktualizacja interfejsu u?ytkownika
												0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x0069,0x006E,0x0074,
												0x0065,0x0072,0x0066,0x0065,0x006A,0x0073,0x0075,0x0020,0x0075,0x017C,0x0079,0x0074,0x006B,0x006F,0x0077,0x006E,
												0x0069,0x006B,0x0061,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_SE_ENABLE
											{
												//Uppgradering av UI
												0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0020,0x0061,0x0076,0x0020,
												0x0055,0x0049,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_JP_ENABLE
											{
												//UI アップグレード
												0x0055,0x0049,0x0020,0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_KR_ENABLE
											{
												//UI ?????
												0x0055,0x0049,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_RU_ENABLE
											{
												//Обновление UI
												0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0055,0x0049,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_AR_ENABLE
											{
												//????? ????? ????????
												0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x0648,0x0627,0x062C,0x0647,0x0629,0x0020,0x0627,0x0644,0x0645,0x0633,
												0x062A,0x062E,0x062F,0x0645,0x0000
											},
										  #endif
										#else
										  #ifdef LANGUAGE_CN_ENABLE
											{
												//图库升级
												0x56FE,0x5E93,0x5347,0x7EA7,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_EN_ENABLE
											{
												//UI Upgrade
												0x0055,0x0049,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										#endif
										};
	uint16_t str_font_title[LANGUAGE_MAX][28] = {
										#ifndef FW_FOR_CN
										  #ifdef LANGUAGE_EN_ENABLE
											{
												//Font Upgrade
												0x0046,0x006F,0x006E,0x0074,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_DE_ENABLE
											{
												//Schriftart-Upgrade
												0x0053,0x0063,0x0068,0x0072,0x0069,0x0066,0x0074,0x0061,0x0072,0x0074,0x2013,0x0055,0x0070,0x0067,0x0072,0x0061,
												0x0064,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_FR_ENABLE
											{
												//Mise à jour de la police
												0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0020,0x0064,0x0065,0x0020,0x006C,
												0x0061,0x0020,0x0070,0x006F,0x006C,0x0069,0x0063,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_IT_ENABLE
											{
												//Aggiornamento del carattere
												0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,
												0x006C,0x0020,0x0063,0x0061,0x0072,0x0061,0x0074,0x0074,0x0065,0x0072,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_ES_ENABLE
											{
												//Actualización de fuente
												0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,
												0x0020,0x0066,0x0075,0x0065,0x006E,0x0074,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_PT_ENABLE
											{
												//Atualiza??o de Fonte
												0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x0065,0x0020,0x0066,
												0x006F,0x006E,0x0074,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_PL_ENABLE
											{
												//Aktualizacja czcionki
												0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x0063,0x007A,0x0063,
												0x0069,0x006F,0x006E,0x006B,0x0069,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_SE_ENABLE
											{
												//Teckensnittsuppgradering
												0x0054,0x0065,0x0063,0x006B,0x0065,0x006E,0x0073,0x006E,0x0069,0x0074,0x0074,0x0073,0x0075,0x0070,0x0070,0x0067,
												0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_JP_ENABLE
											{
												//フォントのアップグレード
												0x30D5,0x30A9,0x30F3,0x30C8,0x306E,0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_KR_ENABLE
											{
												//?? ?????
												0xAE00,0xAF34,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_RU_ENABLE
											{
												//Обновление шрифта
												0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0448,0x0440,0x0438,0x0444,0x0442,
												0x0430,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_AR_ENABLE
											{
												//????? ????
												0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x0627,0x0644,0x062E,0x0637,0x0000
											},
										  #endif
										#else
										  #ifdef LANGUAGE_CN_ENABLE
											{
												//字库升级
												0x5B57,0x5E93,0x5347,0x7EA7,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_EN_ENABLE
											{
												//Font Upgrade
												0x0046,0x006F,0x006E,0x0074,0x0020,0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										#endif
										};
	uint16_t str_ppg_ag_title[LANGUAGE_MAX][34] = {
										#ifndef FW_FOR_CN
										  #ifdef LANGUAGE_EN_ENABLE
											{
												//PPG algorithm Upgrade
												0x0050,0x0050,0x0047,0x0020,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0020,0x0055,0x0070,
												0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_DE_ENABLE
											{
												//PPG-Algorithmus-Upgrade
												0x0050,0x0050,0x0047,0x2013,0x0041,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0075,0x0073,0x2013,
												0x0055,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_FR_ENABLE
											{
												//Mise à niveau de l'algorithme PPG
												0x004D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006E,0x0069,0x0076,0x0065,0x0061,0x0075,0x0020,0x0064,0x0065,
												0x0020,0x006C,0x0027,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0065,0x0020,0x0050,0x0050,
												0x0047,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_IT_ENABLE
											{
												//Aggiornamento dell'algoritmo PPG
												0x0041,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x006D,0x0065,0x006E,0x0074,0x006F,0x0020,0x0064,0x0065,
												0x006C,0x006C,0x0027,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x006F,0x0020,0x0050,0x0050,0x0047,
												0x0000
											},
										  #endif
										  #ifdef LANGUAGE_ES_ENABLE
											{
												//Actualización del algoritmo PPG
												0x0041,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x0069,0x00F3,0x006E,0x0020,0x0064,0x0065,
												0x006C,0x0020,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x006F,0x0020,0x0050,0x0050,0x0047,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_PT_ENABLE
											{
												//Atualiza??o do algoritmo PPG
												0x0041,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x00E7,0x00E3,0x006F,0x0020,0x0064,0x006F,0x0020,0x0061,
												0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x006F,0x0020,0x0050,0x0050,0x0047,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_PL_ENABLE
											{
												//Aktualizacja algorytmu PPG
												0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0061,0x0020,0x0061,0x006C,0x0067,
												0x006F,0x0072,0x0079,0x0074,0x006D,0x0075,0x0020,0x0050,0x0050,0x0047,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_SE_ENABLE
											{
												//Uppgradering av PPG-algoritm
												0x0055,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0069,0x006E,0x0067,0x0020,0x0061,0x0076,0x0020,
												0x0050,0x0050,0x0047,0x2013,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x006D,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_JP_ENABLE
											{
												//PPGアルゴリズムのアップグレード
												0x0050,0x0050,0x0047,0x30A2,0x30EB,0x30B4,0x30EA,0x30BA,0x30E0,0x306E,0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,
												0x30C9,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_KR_ENABLE
											{
												//PPG ???? ?????
												0x0050,0x0050,0x0047,0x0020,0xC54C,0xACE0,0xB9AC,0xC998,0x0020,0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_RU_ENABLE
											{
												//Обновление алгоритма PPG
												0x041E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x0430,0x043B,0x0433,0x043E,0x0440,
												0x0438,0x0442,0x043C,0x0430,0x0020,0x0050,0x0050,0x0047,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_AR_ENABLE
											{
												//????? ???????? PPG
												0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x062E,0x0648,0x0627,0x0631,0x0632,0x0645,0x064A,0x0629,0x0020,0x0047,
												0x0050,0x0050,0x0000
											},
										  #endif
										#else
										  #ifdef LANGUAGE_CN_ENABLE
											{
												//PPG算法升级
												0x0050,0x0050,0x0047,0x7B97,0x6CD5,0x5347,0x7EA7,0x0000
											},
										  #endif
										  #ifdef LANGUAGE_EN_ENABLE
											{
												//PPG algorithm Upgrade
												0x0050,0x0050,0x0047,0x0020,0x0061,0x006C,0x0067,0x006F,0x0072,0x0069,0x0074,0x0068,0x006D,0x0020,0x0055,0x0070,
												0x0067,0x0072,0x0061,0x0064,0x0065,0x0000
											},
										  #endif
										#endif
										};

	LCD_Clear(BLACK);

	switch(g_dl_data_type)
	{
	case DL_DATA_IMG:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JP_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CHN:
	   #endif
	   #ifdef LANGUAGE_JP_ENABLE
	  	case LANGUAGE_JP:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif
			mmi_ucs2smartcpy(str_title, (uint8_t*)str_ui_title[global_settings.language], 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			mmi_ucs2smartcpy(str_title, (uint8_t*)str_ui_title[global_settings.language], 18);
			break;
		}
	#else
		strcpy(str_title, "UI Upgrade");
	#endif
		break;
	case DL_DATA_FONT:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JP_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CHN:
	   #endif
	   #ifdef LANGUAGE_JP_ENABLE
	  	case LANGUAGE_JP:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif		
			mmi_ucs2smartcpy(str_title, (uint8_t*)str_font_title[global_settings.language], 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			mmi_ucs2smartcpy(str_title, (uint8_t*)str_font_title[global_settings.language], 18);
			break;
		}
	#else
		strcpy(str_title, "FONT Upgrade");
	#endif
		break;
	case DL_DATA_PPG:
	#ifdef FONTMAKER_UNICODE_FONT
		switch(global_settings.language)
		{
	 #if defined(LANGUAGE_CN_ENABLE)||defined(LANGUAGE_JP_ENABLE)||defined(LANGUAGE_KR_ENABLE)
	   #ifdef LANGUAGE_CN_ENABLE
	  	case LANGUAGE_CHN:
	   #endif
	   #ifdef LANGUAGE_JP_ENABLE
	  	case LANGUAGE_JP:
	   #endif
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
	   #endif
			mmi_ucs2smartcpy(str_title, (uint8_t*)str_ppg_ag_title[global_settings.language], 16);
			break;
	 #endif/*LANGUAGE_CN_ENABLE||LANGUAGE_JP_ENABLE||LANGUAGE_KR_ENABLE*/
	  
		default:
			mmi_ucs2smartcpy(str_title, (uint8_t*)str_ppg_ag_title[global_settings.language], 18);
			break;
		}
	#else
		strcpy(str_title, "PPG_AG Upgrade");
	#endif
		break;
	}

#ifdef FONTMAKER_UNICODE_FONT
	LCD_SetFontSize(FONT_SIZE_20);
#else	
	LCD_SetFontSize(FONT_SIZE_16);
#endif

#ifdef FONTMAKER_UNICODE_FONT
	LCD_MeasureUniString((uint16_t*)str_title, &w, &h);
	y = 25;
  #ifdef LANGUAGE_AR_ENABLE	
	if(g_language_r2l)
	{
		x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? (LCD_WIDTH-1) : (LCD_WIDTH+w)/2;
		LCD_ShowUniStringRtoL(x, y, (uint16_t*)str_title);
	}
	else
  #endif		
	{
		x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? 0 : (LCD_WIDTH-w)/2;
		LCD_ShowUniString(x, y, (uint16_t*)str_title);
	}
#else
	LCD_MeasureString(str_title, &w, &h);
	x = (w > (DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W))? 0 : ((DL_NOTIFY_RECT_W-2*DL_NOTIFY_OFFSET_W)-w)/2;
	x += (DL_NOTIFY_RECT_X+DL_NOTIFY_OFFSET_W);
	y = 25;
	LCD_ShowString(x,y,str_title);
#endif

#ifdef FONTMAKER_UNICODE_FONT
  #ifdef LANGUAGE_AR_ENABLE
	if(g_language_r2l)
		LCD_ShowUniStringRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_notify[global_settings.language]);
	else
  #endif
		LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_notify[global_settings.language]);
#else
	ShowStringsInRect(DL_NOTIFY_STRING_X, 
					  DL_NOTIFY_STRING_Y, 
					  DL_NOTIFY_STRING_W, 
					  DL_NOTIFY_STRING_H, 
					  "Make sure the battery is more than 80% full or the charger is connected.");
#endif
	LCD_DrawRectangle(DL_NOTIFY_YES_X, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_W, DL_NOTIFY_YES_H);
	LCD_MeasureString("SOS(Y)", &w, &h);
	x = DL_NOTIFY_YES_X+(DL_NOTIFY_YES_W-w)/2;
	y = DL_NOTIFY_YES_Y+(DL_NOTIFY_YES_H-h)/2;	
	LCD_ShowString(x,y,"SOS(Y)");

	LCD_DrawRectangle(DL_NOTIFY_NO_X, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_W, DL_NOTIFY_NO_H);
	LCD_MeasureString("PWR(N)", &w, &h);
	x = DL_NOTIFY_NO_X+(DL_NOTIFY_NO_W-w)/2;
	y = DL_NOTIFY_NO_Y+(DL_NOTIFY_NO_H-h)/2;	
	LCD_ShowString(x,y,"PWR(N)");

