duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	SetRightKeyUpHandler(dl_start);
	SetLeftKeyUpHandler(dl_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_YES_X, DL_NOTIFY_YES_X+DL_NOTIFY_YES_W, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_Y+DL_NOTIFY_YES_H, dl_start);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_NO_X, DL_NOTIFY_NO_X+DL_NOTIFY_NO_W, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_Y+DL_NOTIFY_NO_H, dl_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_exit);
	register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_prev);
#endif

	k_timer_stop(&mainmenu_timer);
	k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
}

void DlUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint8_t strbuf[256] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;
	
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif

	switch(get_dl_status())
	{
	case DL_STATUS_PREPARE:
		flag = false;
		break;
		
	case DL_STATUS_LINKING:
		{
			uint16_t *str_linking[LANGUAGE_MAX] = 
											{
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												str_linking_en,
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												str_linking_de,
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												str_linking_fr,
											  #endif
											  #ifdef LANGUAGE_IT_ENABLE
												str_linking_it,
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												str_linking_es,
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												str_linking_pt,
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												str_linking_pl,
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												str_linking_se,
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												str_linking_jp,
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												str_linking_kr,
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												str_linking_ru,
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												str_linking_ar,
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												str_linking_cn,
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												str_linking_en,
											  #endif
											#endif
											};
			
			LCD_Fill(DL_NOTIFY_RECT_X+1, DL_NOTIFY_STRING_Y, DL_NOTIFY_RECT_W-1, DL_NOTIFY_RECT_H-(DL_NOTIFY_STRING_Y-DL_NOTIFY_RECT_Y)-1, BLACK);
		#ifdef FONTMAKER_UNICODE_FONT
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStringRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_linking[global_settings.language]);
			else
		  #endif
				LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_linking[global_settings.language]);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X,
						  DL_NOTIFY_STRING_Y,
						  DL_NOTIFY_STRING_W,
						  DL_NOTIFY_STRING_H,
						  "Linking to server...");
		#endif
			ClearAllKeyHandler();
		}
		break;
		
	case DL_STATUS_DOWNLOADING:
		if(!flag)
		{
			uint16_t *str_downloading[LANGUAGE_MAX] = {
												#ifndef FW_FOR_CN
											  	  #ifdef LANGUAGE_EN_ENABLE
													str_downloading_en,
												  #endif
												  #ifdef LANGUAGE_DE_ENABLE
													str_downloading_de,
												  #endif
												  #ifdef LANGUAGE_FR_ENABLE
													str_downloading_fr,
												  #endif
												  #ifdef LANGUAGE_IT_ENABLE
													str_downloading_it,
												  #endif
												  #ifdef LANGUAGE_ES_ENABLE
													str_downloading_es,
												  #endif
												  #ifdef LANGUAGE_PT_ENABLE
													str_downloading_pt,
												  #endif
												  #ifdef LANGUAGE_PL_ENABLE
													str_downloading_pl,
												  #endif
												  #ifdef LANGUAGE_SE_ENABLE
													str_downloading_se,
												  #endif
												  #ifdef LANGUAGE_JP_ENABLE
													str_downloading_jp,
											      #endif
												  #ifdef LANGUAGE_KR_ENABLE
													str_downloading_kr,
												  #endif
												  #ifdef LANGUAGE_RU_ENABLE
													str_downloading_ru,
												  #endif
												  #ifdef LANGUAGE_AR_ENABLE
													str_downloading_ar,
												  #endif
												#else
												  #ifdef LANGUAGE_CN_ENABLE
													str_downloading_cn,
												  #endif
												  #ifdef LANGUAGE_EN_ENABLE
													str_downloading_en,
												  #endif
												#endif
												};
			flag = true;
			
			LCD_Fill(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, BLACK);
		#ifdef FONTMAKER_UNICODE_FONT
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStringRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_downloading[global_settings.language]);
			else
		  #endif
				LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_downloading[global_settings.language]);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X, 
							  DL_NOTIFY_STRING_Y,
							  DL_NOTIFY_STRING_W,
							  40,
							  "Upgrading...");
		#endif
			LCD_DrawRectangle(DL_NOTIFY_PRO_X, DL_NOTIFY_PRO_Y, DL_NOTIFY_PRO_W, DL_NOTIFY_PRO_H);
			LCD_Fill(DL_NOTIFY_PRO_X+1, DL_NOTIFY_PRO_Y+1, DL_NOTIFY_PRO_W-1, DL_NOTIFY_PRO_H-1, BLACK);

			sprintf(pro_buf, "%d %%", g_dl_progress);
			memset(strbuf, 0x00, sizeof(strbuf));
			mmi_asc_to_ucs2(strbuf, pro_buf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			pro_str_x = DL_NOTIFY_PRO_NUM_X+(DL_NOTIFY_PRO_NUM_W-w)/2;
			pro_str_y = DL_NOTIFY_PRO_NUM_Y+(DL_NOTIFY_PRO_NUM_H-h)/2;
			LCD_ShowUniString(pro_str_x,pro_str_y, (uint16_t*)strbuf);
		}
		else
		{
			pro_len = (g_dl_progress*DL_NOTIFY_PRO_W)/100;
			LCD_Fill(DL_NOTIFY_PRO_X+1, DL_NOTIFY_PRO_Y+1, pro_len, DL_NOTIFY_PRO_H-1, WHITE);

			sprintf(pro_buf, "%d %%", g_dl_progress);
			memset(strbuf, 0x00, sizeof(strbuf));
			mmi_asc_to_ucs2(strbuf, pro_buf);
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			LCD_ShowUniString(pro_str_x,pro_str_y, (uint16_t*)strbuf);
		}

		ClearAllKeyHandler();
		break;
		
