duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	case DL_STATUS_FINISHED:
		{
			uint16_t *str_finish[LANGUAGE_MAX] = 
											{
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												str_finish_en,
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												str_finish_de,
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												str_finish_fr,
										      #endif
											  #ifdef LANGUAGE_IT_ENABLE
												str_finish_it,
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												str_finish_es,
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												str_finish_pt,
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												str_finish_pl,
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												str_finish_se,
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												str_finish_jp,
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												str_finish_kr,
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												str_finish_ru,
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												str_finish_ar,
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												str_finish_cn,
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												str_finish_en,
											  #endif
											#endif
											};
			
			flag = false;
		
			LCD_Fill(DL_NOTIFY_RECT_X+1, DL_NOTIFY_STRING_Y, DL_NOTIFY_RECT_W-1, DL_NOTIFY_RECT_H-(DL_NOTIFY_STRING_Y-DL_NOTIFY_RECT_Y)-1, BLACK);
			strcpy(strbuf, "Upgraded successfully!");
		#ifdef FONTMAKER_UNICODE_FONT
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStringRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_finish[global_settings.language]);
			else
		  #endif
				LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_finish[global_settings.language]);
		#else	
			ShowStringsInRect(DL_NOTIFY_STRING_X,
							  DL_NOTIFY_STRING_Y,
							  DL_NOTIFY_STRING_W,
							  DL_NOTIFY_STRING_H,
							  strbuf);
		#endif
		
			LCD_DrawRectangle(DL_NOTIFY_YES_X, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_W, DL_NOTIFY_YES_H);
			mmi_asc_to_ucs2(strbuf, "SOS(Y)");
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			x = DL_NOTIFY_YES_X+(DL_NOTIFY_YES_W-w)/2;
			y = DL_NOTIFY_YES_Y+(DL_NOTIFY_YES_H-h)/2;	
			LCD_ShowUniString(x,y,(uint16_t*)strbuf);

			LCD_DrawRectangle(DL_NOTIFY_NO_X, DL_NOTIFY_NO_Y, DL_NOTIFY_NO_W, DL_NOTIFY_NO_H);
			mmi_asc_to_ucs2(strbuf, "PWR(N)");
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			x = DL_NOTIFY_NO_X+(DL_NOTIFY_NO_W-w)/2;
			y = DL_NOTIFY_NO_Y+(DL_NOTIFY_NO_H-h)/2;	
			LCD_ShowUniString(x,y,(uint16_t*)strbuf);

			SetRightKeyUpHandler(dl_reboot_confirm);
			SetLeftKeyUpHandler(dl_exit);
		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_YES_X-10, DL_NOTIFY_YES_X+DL_NOTIFY_YES_W+10, DL_NOTIFY_YES_Y-10, DL_NOTIFY_YES_Y+DL_NOTIFY_YES_H+10, dl_reboot_confirm);
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, DL_NOTIFY_NO_X-10, DL_NOTIFY_NO_X+DL_NOTIFY_NO_W+10, DL_NOTIFY_NO_Y-10, DL_NOTIFY_NO_Y+DL_NOTIFY_NO_H+10, dl_exit);
			register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_exit);
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_prev);
		#endif	

			k_timer_stop(&mainmenu_timer);
			k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
			}
		break;
		
	case DL_STATUS_ERROR:
		{
			uint16_t *str_fail[LANGUAGE_MAX] = {
												#ifndef FW_FOR_CN
												  #ifdef LANGUAGE_EN_ENABLE
													str_fail_en,
												  #endif
												  #ifdef LANGUAGE_DE_ENABLE
													str_fail_de,
												  #endif
												  #ifdef LANGUAGE_FR_ENABLE
													str_fail_fr,
												  #endif
												  #ifdef LANGUAGE_IT_ENABLE
													str_fail_it,
												  #endif
												  #ifdef LANGUAGE_ES_ENABLE
													str_fail_es,
												  #endif
												  #ifdef LANGUAGE_PT_ENABLE
													str_fail_pt,
												  #endif
												  #ifdef LANGUAGE_PL_ENABLE
													str_fail_pl,
												  #endif
												  #ifdef LANGUAGE_SE_ENABLE
													str_fail_se,
												  #endif
												  #ifdef LANGUAGE_JP_ENABLE
													str_fail_jp,
												  #endif
												  #ifdef LANGUAGE_KR_ENABLE
													str_fail_kr,
												  #endif
												  #ifdef LANGUAGE_RU_ENABLE
													str_fail_ru,
												  #endif
												  #ifdef LANGUAGE_AR_ENABLE
													str_fail_ar,
												  #endif
												#else
												  #ifdef LANGUAGE_CN_ENABLE
													str_fail_cn,
												  #endif
												  #ifdef LANGUAGE_EN_ENABLE
													str_fail_en,
												  #endif
												#endif
												};
			
			flag = false;

			LCD_Fill(DL_NOTIFY_RECT_X+1, DL_NOTIFY_STRING_Y, DL_NOTIFY_RECT_W-1, DL_NOTIFY_RECT_H-(DL_NOTIFY_STRING_Y-DL_NOTIFY_RECT_Y)-1, BLACK);
			strcpy(strbuf, "Upgrade failed, please check the network or server.");
		#ifdef FONTMAKER_UNICODE_FONT
		  #ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStringRtoLInRect(LCD_WIDTH-DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_fail[global_settings.language]);
			else
		  #endif
				LCD_ShowUniStringInRect(DL_NOTIFY_STRING_X, DL_NOTIFY_STRING_Y, DL_NOTIFY_STRING_W, DL_NOTIFY_STRING_H, str_fail[global_settings.language]);
		#else
			ShowStringsInRect(DL_NOTIFY_STRING_X,
							  DL_NOTIFY_STRING_Y,
							  DL_NOTIFY_STRING_W,
							  DL_NOTIFY_STRING_H,
							  strbuf);
		#endif
			LCD_DrawRectangle((LCD_WIDTH-DL_NOTIFY_YES_W)/2, DL_NOTIFY_YES_Y, DL_NOTIFY_YES_W, DL_NOTIFY_YES_H);
			mmi_asc_to_ucs2(strbuf, "SOS(Y)");
			LCD_MeasureUniString((uint16_t*)strbuf, &w, &h);
			x = (LCD_WIDTH-DL_NOTIFY_YES_W)/2+(DL_NOTIFY_YES_W-w)/2;
			y = DL_NOTIFY_YES_Y+(DL_NOTIFY_YES_H-h)/2;	
			LCD_ShowUniString(x,y,(uint16_t*)strbuf);

