duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
			SetLeftKeyUpHandler(dl_reboot_confirm);
			SetRightKeyUpHandler(dl_exit);
		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, (LCD_WIDTH-DL_NOTIFY_YES_W)/2-10, (LCD_WIDTH-DL_NOTIFY_YES_W)/2+DL_NOTIFY_YES_W+10, DL_NOTIFY_YES_Y-10, DL_NOTIFY_YES_Y+DL_NOTIFY_YES_H+10, dl_exit);
			register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_exit);
			register_touch_event_handle(TP_EVENT_MOVING_RIGHT, 0, LCD_WIDTH, 0, LCD_HEIGHT, dl_prev);	
		#endif	

			k_timer_stop(&mainmenu_timer);
			k_timer_start(&mainmenu_timer, K_SECONDS(5), K_NO_WAIT);
		}
		break;
		
	case DL_STATUS_MAX:
		flag = false;
		break;
	}
}

void DlScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_DL].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_DL].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_DL].status = SCREEN_STATUS_CREATED;

		DlShowStatus();
		break;
		
	case SCREEN_ACTION_UPDATE:
		if(scr_msg[SCREEN_ID_DL].para&SCREEN_EVENT_UPDATE_DL)
		{
			scr_msg[SCREEN_ID_DL].para &= (~SCREEN_EVENT_UPDATE_DL);
			DlUpdateStatus();
		}

		if(scr_msg[SCREEN_ID_DL].para == SCREEN_EVENT_UPDATE_NO)
			scr_msg[SCREEN_ID_DL].act = SCREEN_ACTION_NO;
		break;
	}
}

#ifdef CONFIG_IMG_DATA_UPDATE
void PrevDlImgScreen(void)
{
	EnterSettings();
}

void ExitDlImgScreen(void)
{
	if((strcmp(g_new_font_ver,g_font_ver) != 0) && (strlen(g_new_font_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
		dl_font_start();
#if defined(CONFIG_PPG_SUPPORT)
	else if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
		dl_ppg_start();
#endif
	else
		EnterPoweroffScreen();
}
#endif

#ifdef CONFIG_FONT_DATA_UPDATE
void PrevDlFontScreen(void)
{
	if((strcmp(g_new_ui_ver,g_ui_ver) != 0) && (strlen(g_new_ui_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
		dl_img_start();
	else
		EnterSettings();
}

void ExitDlFontScreen(void)
{
#if defined(CONFIG_PPG_SUPPORT)
	if((strcmp(g_new_ppg_ver,g_ppg_algo_ver) != 0) && (strlen(g_new_ppg_ver) > 0))
		dl_ppg_start();
	else
#endif
	EnterPoweroffScreen();
}
#endif

#if defined(CONFIG_PPG_DATA_UPDATE)&&defined(CONFIG_PPG_SUPPORT)
void PrevDlPpgScreen(void)
{
	if((strcmp(g_new_font_ver,g_font_ver) != 0) && (strlen(g_new_font_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
		dl_font_start();
	else if((strcmp(g_new_ui_ver,g_ui_ver) != 0) && (strlen(g_new_ui_ver) > 0) && (strcmp(g_new_fw_ver, g_fw_version) == 0))
		dl_img_start();
	else
		EnterSettings();
}

void ExitDlPpgScreen(void)
{
	EnterPoweroffScreen();
}
#endif


void EnterDlScreen(void)
{
#ifdef CONFIG_ANIMATION_SUPPORT	
	AnimaStop();
#endif
#ifdef CONFIG_TEMP_SUPPORT
	if(TempIsWorking())
		MenuStopTemp();
#endif

	history_screen_id = screen_id;
	scr_msg[history_screen_id].act = SCREEN_ACTION_NO;
	scr_msg[history_screen_id].status = SCREEN_STATUS_NO;

	screen_id = SCREEN_ID_DL;	
	scr_msg[SCREEN_ID_DL].act = SCREEN_ACTION_ENTER;
	scr_msg[SCREEN_ID_DL].status = SCREEN_STATUS_CREATING;

	k_timer_stop(&mainmenu_timer);
}
#endif/*CONFIG_DATA_DOWNLOAD_SUPPORT*/

#ifdef CONFIG_FOTA_DOWNLOAD
void FOTAShowStatus(void)
{
	uint16_t x,y,w,h;
	uint16_t tmpbuf1[128] = {0};
	uint16_t tmpbuf2[128] = {0};
	uint16_t str_notify[LANGUAGE_MAX][44] = {
											#ifndef FW_FOR_CN
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0043,0x006F,0x006E,0x0074,0x0069,0x006E,0x0075,0x0065,0x0020,0x0074,0x006F,0x0020,0x0075,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0074,0x0068,0x0065,0x0020,0x0066,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x003F,0x0000},//Continue to upgrade the firmware?
											  #endif
											  #ifdef LANGUAGE_DE_ENABLE
												{0x0041,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x0073,0x0069,0x0065,0x0072,0x0075,0x006E,0x0067,0x0020,0x0064,0x0065,0x0072,0x0020,0x0046,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x0020,0x0066,0x006F,0x0072,0x0074,0x0066,0x0061,0x0068,0x0072,0x0065,0x006E,0x003F,0x0000},//Aktualisierung der Firmware fortfahren?
											  #endif
											  #ifdef LANGUAGE_FR_ENABLE
												{0x0043,0x006F,0x006E,0x0074,0x0069,0x006E,0x0075,0x0065,0x0072,0x0020,0x006C,0x0061,0x0020,0x006D,0x0069,0x0073,0x0065,0x0020,0x00E0,0x0020,0x006A,0x006F,0x0075,0x0072,0x0020,0x0064,0x0075,0x0020,0x0066,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x003F,0x0000},//Continuer la mise à jour du firmware?
											  #endif
											  #ifdef LANGUAGE_IT_ENABLE
												{0x0043,0x006F,0x006E,0x0074,0x0069,0x006E,0x0075,0x0061,0x0020,0x0061,0x0020,0x0061,0x0067,0x0067,0x0069,0x006F,0x0072,0x006E,0x0061,0x0072,0x0065,0x0020,0x0069,0x006C,0x0020,0x0066,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x003F,0x0000},//Continua a aggiornare il firmware?
											  #endif
											  #ifdef LANGUAGE_ES_ENABLE
												{0x00BF,0x0053,0x0065,0x0067,0x0075,0x0069,0x0072,0x0020,0x0061,0x0063,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x006E,0x0064,0x006F,0x0020,0x0065,0x006C,0x0020,0x0066,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x003F,0x0000},//?Seguir actualizando el firmware?
											  #endif
											  #ifdef LANGUAGE_PT_ENABLE
												{0x0043,0x006F,0x006E,0x0074,0x0069,0x006E,0x0075,0x0061,0x0072,0x0020,0x0061,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x006E,0x0064,0x006F,0x0020,0x006F,0x0020,0x0066,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x003F,0x0000},//Continuar atualizando o firmware?
											  #endif
											  #ifdef LANGUAGE_PL_ENABLE
												{0x004B,0x006F,0x006E,0x0074,0x0020,0x0061,0x006B,0x0074,0x0075,0x0061,0x006C,0x0069,0x007A,0x0061,0x0063,0x006A,0x0119,0x003F,0x0000},//Kont aktualizacj??
											  #endif
											  #ifdef LANGUAGE_SE_ENABLE
												{0x0046,0x006F,0x0072,0x0074,0x0073,0x00E4,0x0074,0x0074,0x0061,0x0020,0x0075,0x0070,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0072,0x0061,0x0020,0x0066,0x0061,0x0073,0x0074,0x0076,0x0061,0x0072,0x0061,0x006E,0x003F,0x0000},//Forts?tta uppgradera fastvaran?
											  #endif
											  #ifdef LANGUAGE_JP_ENABLE
												{0x30A2,0x30C3,0x30D7,0x30B0,0x30EC,0x30FC,0x30C9,0x3092,0x7D9A,0x3051,0x307E,0x3059,0x304B,0xFF1F,0x0000},//アップグレードを続けますか？
											  #endif
											  #ifdef LANGUAGE_KR_ENABLE
												{0xC5C5,0xADF8,0xB808,0xC774,0xB4DC,0x0020,0xACC4,0xC18D,0xD558,0xAE30,0xFF1F,0x0000},//????? ????？
											  #endif
											  #ifdef LANGUAGE_RU_ENABLE
												{0x041F,0x0440,0x043E,0x0434,0x043E,0x043B,0x0436,0x0438,0x0442,0x044C,0x0020,0x043E,0x0431,0x043D,0x043E,0x0432,0x043B,0x0435,0x043D,0x0438,0x0435,0x0020,0x043F,0x0440,0x043E,0x0448,0x0438,0x0432,0x043A,0x0438,0x003F,0x0000},//Продолжить обновление прошивки?
											  #endif
											  #ifdef LANGUAGE_AR_ENABLE
												{0x0647,0x0644,0x0020,0x062A,0x0631,0x064A,0x062F,0x0020,0x0627,0x0644,0x0627,0x0633,0x062A,0x0645,0x0631,0x0627,0x0631,0x0020,0x0641,0x064A,0x0020,0x062A,0x0631,0x0642,0x064A,0x0629,0x0020,0x0627,0x0644,0x0628,0x0631,0x0627,0x0645,0x062C,0x0020,0x0627,0x0644,0x062B,0x0627,0x0628,0x062A,0x0629,0x061F,0x0000},//?? ???? ????????? ?? ????? ??????? ????????
											  #endif
											#else
											  #ifdef LANGUAGE_CN_ENABLE
												{0x7EE7,0x7EED,0x5347,0x7EA7,0x56FA,0x4EF6,0xFF1F,0x0000},//继续升级固件？
											  #endif
											  #ifdef LANGUAGE_EN_ENABLE
												{0x0043,0x006F,0x006E,0x0074,0x0069,0x006E,0x0075,0x0065,0x0020,0x0074,0x006F,0x0020,0x0075,0x0070,0x0067,0x0072,0x0061,0x0064,0x0065,0x0020,0x0074,0x0068,0x0065,0x0020,0x0066,0x0069,0x0072,0x006D,0x0077,0x0061,0x0072,0x0065,0x003F,0x0000},//Continue to upgrade the firmware?
											  #endif
											#endif
											};

	LCD_Clear(BLACK);
	
	LCD_ShowImg_From_Flash(FOTA_LOGO_X, FOTA_LOGO_Y, IMG_OTA_LOGO_ADDR);
	LCD_ShowImg_From_Flash(FOTA_YES_X, FOTA_YES_Y, IMG_OTA_YES_ADDR);
	LCD_ShowImg_From_Flash(FOTA_NO_X, FOTA_NO_Y, IMG_OTA_NO_ADDR);

#ifdef FONTMAKER_UNICODE_FONT
	switch(global_settings.language)
	{
   #ifdef LANGUAGE_CN_ENABLE
	case LANGUAGE_CHN:
		LCD_MeasureUniString(str_notify[global_settings.language], &w, &h);
		LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, str_notify[global_settings.language]);
		break;
   #endif
  
	default:
		switch(global_settings.language)
		{
	   #ifdef LANGUAGE_EN_ENABLE
		case LANGUAGE_EN:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*12);
			memcpy(tmpbuf2, &str_notify[global_settings.language][12], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-12));
			break;
	   #endif

	   #ifdef LANGUAGE_DE_ENABLE
		case LANGUAGE_DE:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*19);
			memcpy(tmpbuf2, &str_notify[global_settings.language][19], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-19));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_FR_ENABLE
		case LANGUAGE_FR:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*20);
			memcpy(tmpbuf2, &str_notify[global_settings.language][20], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-20));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_IT_ENABLE
		case LANGUAGE_ITA:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*11);
			memcpy(tmpbuf2, &str_notify[global_settings.language][11], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-11));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_ES_ENABLE
		case LANGUAGE_ES:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*21);
			memcpy(tmpbuf2, &str_notify[global_settings.language][21], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-21));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_PT_ENABLE
		case LANGUAGE_PT:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*22);
			memcpy(tmpbuf2, &str_notify[global_settings.language][22], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-22));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_PL_ENABLE
		case LANGUAGE_PL:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*18);
			break;
	   #endif
	   
	   #ifdef LANGUAGE_SE_ENABLE
		case LANGUAGE_SE:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*21);
			memcpy(tmpbuf2, &str_notify[global_settings.language][21], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-21));
			break;
	   #endif
	   
