duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
	   #ifdef LANGUAGE_JP_ENABLE
		case LANGUAGE_JP:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*14);
			//memcpy(tmpbuf2, &str_notify[global_settings.language][13], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-13));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_KR_ENABLE
		case LANGUAGE_KR:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*11);
			memcpy(tmpbuf2, &str_notify[global_settings.language][11], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-11));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_RU_ENABLE
		case LANGUAGE_RU:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*22);
			memcpy(tmpbuf2, &str_notify[global_settings.language][22], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-22));
			break;
	   #endif
	   
	   #ifdef LANGUAGE_AR_ENABLE
		case LANGUAGE_AR:
			memcpy(tmpbuf1, &str_notify[global_settings.language][0], 2*21);
			memcpy(tmpbuf2, &str_notify[global_settings.language][21], 2*(mmi_ucs2strlen(str_notify[global_settings.language])-21));
			break;
	   #endif
		}
		
		LCD_MeasureUniString(tmpbuf1, &w, &h);
	#ifdef LANGUAGE_AR_ENABLE	
		if(g_language_r2l)
			LCD_ShowUniStringRtoL((LCD_WIDTH+w)/2, FOTA_START_STR_Y, tmpbuf1);
		else
	#endif
			LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y, tmpbuf1);

		if(mmi_ucs2strlen((uint8_t*)tmpbuf2) > 0)
		{
			LCD_MeasureUniString(tmpbuf2, &w, &h);
		#ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
				LCD_ShowUniStringRtoL((LCD_WIDTH+w)/2, FOTA_START_STR_Y+h+2, tmpbuf2);
			else
		#endif		
				LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+h+2, tmpbuf2);
		}
		break;
	}
#endif

	SetRightKeyUpHandler(fota_excu);
	SetLeftKeyUpHandler(fota_exit);
#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_YES_X-30, FOTA_YES_X+FOTA_YES_W+30, FOTA_YES_Y-30, FOTA_YES_Y+FOTA_YES_H+30, fota_excu);
	register_touch_event_handle(TP_EVENT_SINGLE_CLICK, FOTA_NO_X-30, FOTA_NO_X+FOTA_NO_W+30, FOTA_NO_Y-30, FOTA_NO_Y+FOTA_NO_H+30, fota_exit);
	register_touch_event_handle(TP_EVENT_MOVING_LEFT, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_exit);	
#endif
}

void FOTAUpdateStatus(void)
{
	uint16_t pro_len;
	uint16_t x,y,w,h;
	uint8_t pro_buf[16] = {0};
	uint16_t tmpbuf[128] = {0};
	static bool flag = false;
	static uint16_t pro_str_x,pro_str_y;

#ifdef CONFIG_TOUCH_SUPPORT
	clear_all_touch_event_handle();
#endif	
	switch(get_fota_status())
	{
	case FOTA_STATUS_PREPARE:
		flag = false;
		break;
		
	case FOTA_STATUS_LINKING:
		{
			uint16_t *str_notify[LANGUAGE_MAX] = {
													#ifndef FW_FOR_CN
													  #ifdef LANGUAGE_EN_ENABLE
														str_linking_en,
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														str_linking_de,
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														str_linking_fr,
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														str_linking_it,
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														str_linking_es,
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														str_linking_pt,
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														str_linking_pl,
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														str_linking_se,
													  #endif
													  #ifdef LANGUAGE_JP_ENABLE
														str_linking_jp,
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														str_linking_kr,
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														str_linking_ru,
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														str_linking_ar,
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														str_linking_cn,
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														str_linking_en,
													  #endif
													#endif
													};

			LCD_Fill(0, FOTA_YES_Y, LCD_WIDTH, FOTA_YES_H, BLACK);
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

		#ifdef FONTMAKER_UNICODE_FONT
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
		  #ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
				LCD_ShowUniStringRtoL((LCD_WIDTH+w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, tmpbuf);
			else
		  #endif
				LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, tmpbuf);
		#endif

			ClearAllKeyHandler();
		}
		break;
		
	case FOTA_STATUS_DOWNLOADING:
		if(!flag)
		{
			uint16_t *str_notify[LANGUAGE_MAX] = {
													#ifndef FW_FOR_CN
													  #ifdef LANGUAGE_EN_ENABLE
														str_downloading_en,
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														str_downloading_de,
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														str_downloading_fr,
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														str_downloading_it,
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														str_downloading_es,
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														str_downloading_pt,
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														str_downloading_pl,
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														str_downloading_se,
													  #endif
													  #ifdef LANGUAGE_JP_ENABLE
														str_downloading_jp,
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														str_downloading_kr,
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														str_downloading_ru,
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														str_downloading_ar,
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														str_downloading_cn,
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														str_downloading_en,
													  #endif
													#endif
													};
			
