duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_TEST_0306/src/screen/screen.c
			flag = true;
			
			LCD_Fill(0, FOTA_START_STR_Y, LCD_WIDTH, FOTA_START_STR_H, BLACK);

			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
		#ifdef LANGUAGE_AR_ENABLE
			if(g_language_r2l)
				LCD_ShowUniStringRtoL((LCD_WIDTH+w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, tmpbuf);
			else
		#endif
				LCD_ShowUniString(FOTA_START_STR_X+(FOTA_START_STR_W-w)/2, FOTA_START_STR_Y+(FOTA_START_STR_H-h)/2, tmpbuf);
					
			LCD_DrawRectangle(FOTA_PROGRESS_X, FOTA_PROGRESS_Y, FOTA_PROGRESS_W, FOTA_PROGRESS_H);
			LCD_Fill(FOTA_PROGRESS_X+1, FOTA_PROGRESS_Y+1, FOTA_PROGRESS_W-1, FOTA_PROGRESS_H-1, BLACK);
			
			sprintf(pro_buf, "%d %%", g_fota_progress);
		#ifdef FONTMAKER_UNICODE_FONT
			LCD_SetFontSize(FONT_SIZE_20);
		#else	
			LCD_SetFontSize(FONT_SIZE_16);
		#endif
			memset(tmpbuf, 0x0000, sizeof(tmpbuf));
			mmi_asc_to_ucs2(tmpbuf, pro_buf);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			pro_str_x = FOTA_PRO_NUM_X+(FOTA_PRO_NUM_W-w)/2;
			pro_str_y = FOTA_PRO_NUM_Y+(FOTA_PRO_NUM_H-h)/2;
			LCD_ShowUniString(pro_str_x,pro_str_y, tmpbuf);
		}
		else
		{
			pro_len = (g_fota_progress*FOTA_PROGRESS_W)/100;
			LCD_Fill(FOTA_PROGRESS_X+1, FOTA_PROGRESS_Y+1, pro_len, FOTA_PROGRESS_H-1, WHITE);
			
			sprintf(pro_buf, "%d %%", g_fota_progress);
			memset(tmpbuf, 0x0000, sizeof(tmpbuf));
			mmi_asc_to_ucs2(tmpbuf, pro_buf);
			LCD_MeasureUniString(tmpbuf, &w, &h);
			LCD_ShowUniString(pro_str_x, pro_str_y, tmpbuf);
		}		

		ClearAllKeyHandler();
		break;
		
	case FOTA_STATUS_FINISHED:
		{
			static bool is_finished = false;
			uint16_t *str_notify[LANGUAGE_MAX] = {
													#ifndef FW_FOR_CN
													  #ifdef LANGUAGE_EN_ENABLE
														str_finish_en,
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														str_finish_de,
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														str_finish_fr,
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														str_finish_it,
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														str_finish_es,
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														str_finish_pt,
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														str_finish_pl,
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														str_finish_se,
													  #endif
													  #ifdef LANGUAGE_JP_ENABLE
														str_finish_jp,
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														str_finish_kr,
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														str_finish_ru,
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														str_finish_ar,
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														str_finish_cn,
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														str_finish_en,
													  #endif
													#endif
													};
			
			flag = false;

			if(!is_finished)
			{
				is_finished = true;
				
				LCD_Clear(BLACK);
				LCD_ShowImg_From_Flash(FOTA_FINISH_ICON_X, FOTA_FINISH_ICON_Y, IMG_OTA_FINISH_ICON_ADDR);
				
			#ifdef FONTMAKER_UNICODE_FONT
				mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
				LCD_MeasureUniString(tmpbuf, &w, &h);
			  #ifdef LANGUAGE_AR_ENABLE	
				if(g_language_r2l)
					LCD_ShowUniStringRtoL((LCD_WIDTH+w)/2, FOTA_FINISH_STR_Y+(FOTA_FINISH_STR_H-h)/2, tmpbuf);
				else
			  #endif
					LCD_ShowUniString(FOTA_FINISH_STR_X+(FOTA_FINISH_STR_W-w)/2, FOTA_FINISH_STR_Y+(FOTA_FINISH_STR_H-h)/2, tmpbuf);
			#endif
			
				SetLeftKeyUpHandler(fota_reboot_confirm);
				SetRightKeyUpHandler(fota_reboot_confirm);
			#ifdef CONFIG_TOUCH_SUPPORT
				register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_reboot_confirm);
			#endif
			}
		}
		break;
		
	case FOTA_STATUS_ERROR:
		{
			uint16_t *str_notify[LANGUAGE_MAX] = {
													#ifndef FW_FOR_CN
													  #ifdef LANGUAGE_EN_ENABLE
														str_fail_en,
													  #endif
													  #ifdef LANGUAGE_DE_ENABLE
														str_fail_de,
													  #endif
													  #ifdef LANGUAGE_FR_ENABLE
														str_fail_fr,
													  #endif
													  #ifdef LANGUAGE_IT_ENABLE
														str_fail_it,
													  #endif
													  #ifdef LANGUAGE_ES_ENABLE
														str_fail_es,
													  #endif
													  #ifdef LANGUAGE_PT_ENABLE
														str_fail_pt,
													  #endif
													  #ifdef LANGUAGE_PL_ENABLE
														str_fail_pl,
													  #endif
													  #ifdef LANGUAGE_SE_ENABLE
														str_fail_se,
												      #endif
													  #ifdef LANGUAGE_JP_ENABLE
														str_fail_jp,
													  #endif
													  #ifdef LANGUAGE_KR_ENABLE
														str_fail_kr,
													  #endif
													  #ifdef LANGUAGE_RU_ENABLE
														str_fail_ru,
													  #endif
													  #ifdef LANGUAGE_AR_ENABLE
														str_fail_ar,
													  #endif
													#else
													  #ifdef LANGUAGE_CN_ENABLE
														str_fail_cn,
													  #endif
													  #ifdef LANGUAGE_EN_ENABLE
														str_fail_en,
													  #endif
													#endif
													};
			
			flag = false;

			LCD_Clear(BLACK);
			LCD_ShowImg_From_Flash(FOTA_FAIL_ICON_X, FOTA_FAIL_ICON_Y, IMG_OTA_FAILED_ICON_ADDR);
			
		#ifdef FONTMAKER_UNICODE_FONT
			mmi_ucs2smartcpy((uint8_t*)tmpbuf, (uint8_t*)str_notify[global_settings.language], MENU_NOTIFY_STR_MAX);
			LCD_MeasureUniString(tmpbuf, &w, &h);
		  #ifdef LANGUAGE_AR_ENABLE	
			if(g_language_r2l)
				LCD_ShowUniStringRtoL((LCD_WIDTH+w)/2, FOTA_FAIL_STR_Y+(FOTA_FAIL_STR_H-h)/2, tmpbuf);
			else
		  #endif
				LCD_ShowUniString(FOTA_FAIL_STR_X+(FOTA_FAIL_STR_W-w)/2, FOTA_FAIL_STR_Y+(FOTA_FAIL_STR_H-h)/2, tmpbuf);
		#endif	

			SetLeftKeyUpHandler(fota_exit);
			SetRightKeyUpHandler(fota_exit);
		#ifdef CONFIG_TOUCH_SUPPORT
			register_touch_event_handle(TP_EVENT_SINGLE_CLICK, 0, LCD_WIDTH, 0, LCD_HEIGHT, fota_exit);
		#endif	
		}
		break;
		
	case FOTA_STATUS_MAX:
		flag = false;
		break;
	}
}

void FOTAScreenProcess(void)
{
	switch(scr_msg[SCREEN_ID_FOTA].act)
	{
	case SCREEN_ACTION_ENTER:
		scr_msg[SCREEN_ID_FOTA].act = SCREEN_ACTION_NO;
		scr_msg[SCREEN_ID_FOTA].status = SCREEN_STATUS_CREATED;

